[
  {
    "title": "Create Category Level Promos",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tAugust 4, 2023\nCompatible Version: 8.302Does your Exatouch look different? View prior release →\nPromos can be applied to a group of items that share a Category. Run Category Level Promos during specific hours during the day, for a specific time period.\n\nFrom Home, navigate to Items > Categories to display the Categories screen.\nSelect a category, scrolling through the Categories list to find a specific category.\n\nTip! If the category you need is not in your system, create a new category and add the appropriate items to the category. See: Create Categories and Subcategories.\nSelect the On Sale checkbox. The On Sale pricing work area displays.\n\nNote: The Buy and Promo fields must be configured, and at least one day of the week must be selected to run this promotion. Some Promo options may require additional information.\n\nIn the Buy field, enter the number of items a customer needs to purchase to receive the Promo.\nSelect a Promo, then configure one of the following:\nDollar Amount: For dollar-based promos, enter the discount in dollars that a customer receives for this promo.\nPercentage: For percentage-based promos, enter the discount as a percentage that a customer receives for this promo.\n\nNote: This field displays either as Dollar Amount or Percentage off, depending on the type of promo selected in the Promo field. The field displays as inactive for Get one free or Get one half price promos.\n\n\nNote: Discounts apply to the lowest priced item sold as part of the promotion.\nOptional: Configure the following fields, as desired:\nMax Per Trx: Enter the maximum amount of qualifying purchases customers can make to receive the promo.\nStart Date: Select the date the promo begins.\nEnd (Date): Select the date the promo ends.\nDaily Time Start: Select the time the promo begins.\nEnd (Time): Select the time the promo ends.\nSelect the desired the days to run this promo. At least one day must be enabled. If no days are enabled, this promo will not run. Default: All.\n\nExample: This promo only runs on Fridays.\n\nAfter completing your changes, tap Save. This promo is now active for all items in this category for the days and times selected.\n\n\nBuy: (Required) Enter the number of items a customer must purchase to apply this promo.\nPromo: (Required) Select a promo from the Promo drop-down menu.\n\n\nGet one free: Purchase the number of items in the Buy field to get an additional item free. The customer must purchase at least one more eligible promo item than listed in Buy to get a free item. The free item will be of equal or lesser value than other eligible items.\nGet one half price: Purchase the number of items in the Buy field to get an additional item at half price. The customer must purchase at least one more eligible promo item than listed in Buy to get a half price item. The half price item will be of equal or lesser value than other eligible items.\nGet one for percentage off:  In addition to the Get item(s), this promo is applied to the single item purchased.\n\nEnter a Percentage amount, up to two decimal places, to discount the item.\n\n\nFor dollar amount: Buy one or more items at the specified price. The purchase of only one item is required to activate this promo. If multiple items are purchased, the promo price is applied to all items.\n\nEnter a Dollar Amount, up to two decimal places, to discount the item(s).\n\n\nFor percentage off: Buy one or more items for a percentage off the original purchase price. The purchase of only one item is required to activate this promo.\n\nEnter a Percentage amount, up to two decimal places, to discount the item(s).\n\n\nFor dollar amount off:  Buy one or more items for a dollar amount off.\n\nEnter a Dollar Amount, up to two decimal places, to discount the item(s).\n\nGet one free: Purchase the number of items in the Buy field to get an additional item free. The customer must purchase at least one more eligible promo item than listed in Buy to get a free item. The free item will be of equal or lesser value than other eligible items.\nGet one half price: Purchase the number of items in the Buy field to get an additional item at half price. The customer must purchase at least one more eligible promo item than listed in Buy to get a half price item. The half price item will be of equal or lesser value than other eligible items.\nGet one for percentage off:  In addition to the Get item(s), this promo is applied to the single item purchased.\nEnter a Percentage amount, up to two decimal places, to discount the item.\nFor dollar amount: Buy one or more items at the specified price. The purchase of only one item is required to activate this promo. If multiple items are purchased, the promo price is applied to all items.\nEnter a Dollar Amount, up to two decimal places, to discount the item(s).\nFor percentage off: Buy one or more items for a percentage off the original purchase price. The purchase of only one item is required to activate this promo.\nEnter a Percentage amount, up to two decimal places, to discount the item(s).\nFor dollar amount off:  Buy one or more items for a dollar amount off.\nEnter a Dollar Amount, up to two decimal places, to discount the item(s).\nStart Date and End Date: (Optional) Specify the start and end date for the promo.\nDaily Time Start and End: (Optional) Specify the start and end time for the promo if it is a partial-day promotion.\nSun – Sat fields: (Required) Enable all days for this promotion to run. At least one day must be enabled.\n\n\nSample promotion settings:\n\nExample: TGIF Special on Appetizers: Buy one appetizer, get one 50% all day Friday.\n\n\nExample: Seasonal Hair Care Sale: All hair care products on sale at the discounted price of $3.99.\n\n\nExample: Salon Services Promo: Purchase one nail service and receive a second one of equal or lesser value for 20% off.\n\n\n\nCheck your work by ringing up promo items in the Register app.\n\nItems sold with a promotional discount are shown in a Green font color. Items sold at regular price are shown in a Black font color.\nThe total amount of the Promo discount is shown as a separate line item in the Totals area.\nDiscounts are displayed in the register app by default. Admins can change this setting in Register Preferences. See: Manage Promo Preferences\n\nSet Up & Manage Promotions\nApply Promos\nWhat Type of Promo Should I Create?Last Updated: July 28, 2023\nLast Updated: July 28, 2023\nHow to Use PromosLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nManage Promo PreferencesLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nCreate Item Level PromosLast Updated: August 2, 2023\nLast Updated: August 2, 2023\nCreate Subcategory Level PromosLast Updated: August 8, 2023\nLast Updated: August 8, 2023\nCreate Mix & Match PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nCreate Promo LayersLast Updated: July 31, 2023\nLast Updated: July 31, 2023\nDeactivate Discounts and PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-category-level-promos/"
  },
  {
    "title": "How to Use Promos",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJuly 28, 2023\nPromos (aka Promotions) are applied to items or to groups of items automatically when a customer pays for an order. Promos can be active at specific hours or for a duration of time. BOGOs can be created for each of the four types of Promos.\nItem Level Promos: Discount a single item or apply a discount when several of the same items are purchased. See: Create Item Level Promos\nCategory Level Promos: Apply a discount to an entire category of items. See: Create Category Level Promos\nSubcategory Level Promos: Apply a discount to an entire subcategory of items. See: Create Subcategory Level Promos\nMix & Match Promos: Create discounts on a combination of specifically chosen items from categories, subcategories, and/or individual items. See: Create Mix & Match Promos\nTip! Create Happy Hour Promos! Promo Layers can be used to “layer” times and values onto a promo, so you can create a series of promos which apply during specific hours during the day. Restaurants and bars use this to create Happy Hour specials. See Happy Hour Specials: Use Promo Layers\n\n\nConfigure Promo preferences by navigating to Settings > Register Preferences and tapping the Promos tab.\nBy default, promos are applied automatically when relevant items are rung up, but you can manually apply promos at the Register as well.\nSee: Manage Promo Preferences\n\n\nPromos are applied automatically when a customer pays for an order.\nBy default, the Auto Refresh Promo setting is disabled. When enabled, the Refresh Promo button displays at the Register and promo discounts appear as an order is rung up.\n\n\n\nNote: Remember that Services are a type of Item. Promos are created for Services just as easily as Promos are created for Items. To create Service Promos, from Home navigate to Items > Service Details and tap the Promos tab.\nTip! Promos are different from Discounts. Promos apply automatically to items when rung up at the register. Discounts are applied manually at the register. See: How to Use Discounts\n\nClick here to schedule your software update today!\nSet Up & Manage Promotions\nApply Promos\nWhat Type of Promo Should I Create?Last Updated: July 28, 2023\nLast Updated: July 28, 2023\nManage Promo PreferencesLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nCreate Item Level PromosLast Updated: August 2, 2023\nLast Updated: August 2, 2023\nCreate Category Level PromosLast Updated: August 4, 2023\nLast Updated: August 4, 2023\nCreate Subcategory Level PromosLast Updated: August 8, 2023\nLast Updated: August 8, 2023\nCreate Mix & Match PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nCreate Promo LayersLast Updated: July 31, 2023\nLast Updated: July 31, 2023\nDeactivate Discounts and PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/how-to-use-promos/"
  },
  {
    "title": "Create Item Level Promos",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tAugust 2, 2023\nCompatible Version: 8.302Does your Exatouch look different? View prior release →\nItem Level Promos are promotions applied to a single item. Promos can be run during specific hours during the day, for a specific time period.\nExample: Liquor Store: offers a Buy One, Get One (BOGO) special: Buy one 18-pack of Bud Light Anniversary, get a second pack at 50% off.\nExample: Spa: Mother’s Day Special: 25% off the purchase of a 50-minute Swedish Massage.\nExample: Bakery or Market Deli: Seasonal Pie Sale: Pumpkin Pie on sale at the discounted price of $6.99/pie (regular price $10.99/pie).\n\nFrom Home, navigate to Items > Item List.\nOn the Items List screen, scroll or search for a specific item.\nTap the Promos tab on the Item Details screen that displays.\nEnable the On Sale slider and configure promo information as desired in the Buy field and Promo Type drop-down menu.\n\nNote: Discounts apply to the lowest item sold as part of the promotion.\n\nEnable one or more Sale Days when the promotion will run.\nOptional: Specify date ranges and times for the promotion by configuring the Start Date, End Date, Start Time, and End Time settings.\nTap Save.\n\n\nBuy: Enter the amount of items a customer must purchase to qualify for discounts/promotions.\nPromo Type: Select the desired promotion from the drop-down menu.\nMax Per Trx: Enter the maximum amount of the item a customer can buy per transaction (e.g., a merchant may limit quantities sold to prevent the item from selling out too quickly).\nStart Date: Select the date the discount/promotion begins.\nEnd Date: Select the date the discount/promotion ends.\nStart Time: Select the time the discount/promotion begins.\nEnd Time: Select the time the discount/promotion ends.\n\nNote: Promos with a set end date and/or time will expire automatically. Nevertheless, promos can be deactivated at any time. See: Deactivate Discounts and Promos.\n\nExclusive For: Select the desired club membership level(s) to receive club discounts/promotions.\nPromotions: Select the desired promo layers and add a discount/promotion price for each item group.\n\nPromo 2: Select to enable and enter promo layer for Promo 2.\nPromo 3: Select to enable and enter promo layer for Promo 3.\nPromo 4: Select to enable and enter promo layer for Promo 4.\nSee: Create Promo Layers\nPromo 2: Select to enable and enter promo layer for Promo 2.\nPromo 3: Select to enable and enter promo layer for Promo 3.\nPromo 4: Select to enable and enter promo layer for Promo 4.\n\nSee: Create Promo Layers\n\nExample: Liquor Store: offers a Buy One, Get One (BOGO) special: Buy one 18-pack of Bud Light Anniversary, get a second pack at 50% off on Fridays in July.\n\n\n\n\n\nExample: Spa: Mother’s Day Special: 25% off the purchase of a 50-minute Swedish Massage. This sale is valid for two weeks before Mothers Day.\n\n\n\n\n\nExample: Bakery or Market Deli: Seasonal Pie Sale: Pumpkin Pie on sale at the discounted price of $6.99/pie (regular price $10.99/pie). Sale prices is good for the second and third week of November.\n\n\n\n\nCheck your work by ringing up promo items at the Register. View the promo discount amount above the order total. Promo discounts display at the Register by default. This setting can be modified in Register Preferences. See: Manage Promo Preferences.\n\n\nYou can quickly and easily configure and apply a promo for a group of similar items. Create a temporary list of items, then use Modify All List Items to apply the same promotion to the items you’ve selected.\nFrom the Items List screen, tap Advanced Item Search to create a temporary list of items.\nOn the pop-up that displays, select the desired filters and then tap Search.\nReview search results to ensure all desired items are included, then tap Modify All List Items.\nIn the work area that displays, tap the Promo tab.\nSelect the On Sale checkbox to activate the On Sale work area.\nConfigure the following Promo settings:\nBuy: Enter the amount of items a customer must purchase to receive the promo.\nPromo: Select the desired promotion from the drop-down.\nDollar Amount/Percentage off: For dollar-based promos, enter the discount in dollars that a customer receives for this promo. For percentage-based promos, enter the discount as a percentage that a customer receives for this promo.\n\nNote: This field displays either as Dollar Amount or Percentage off, depending on the type of promo selected in the Promo field. The field displays as inactive for Get one free or Get one half price promos.\n\nSelect at least one day of the week.\nAll other fields are optional.\nTap OK.\nOn the warning pop-up that displays, tap Yes to confirm or No to continue making changes.\n\nWarning: These promos are immediately active for the list of items, unless constrained by day, date, and times. Do not tap Yes until you are ready to apply these changes. See: Modify Items in Bulk.\n\n\n\nYou can set up and apply a Promo for a group of similar services quickly and easily by following the same process as applying promos to groups of items. Create a temporary list of services, then use Modify All List Services to apply the same promotion on the items you’ve selected.\nFrom the Items screen, tap Advanced Services Search to create a temporary list of services.\nSelect the desired filters from the pop-up window that displays, then tap Search.\nReview search results and tap Modify All List Services.\nFrom the Modify All List Services work area, tap the Promo tab, then configure promo settings as desired.\nSelect the On Sale checkbox and configure service promo settings as desired.\nNote: Service group promos feature the same settings as Item group promos. See: Apply Promo to a Group of Items.\n\nNote: Service group promos feature the same settings as Item group promos. See: Apply Promo to a Group of Items.\n\nTap OK, then confirm and reconfirm promo service changes.\n\nWarning: These promos are immediately active for the list of items, unless constrained by day, date, and times. Do not tap Yes until you are ready to apply these changes. See: Modify Items in Bulk.\n\n\n\n\nExample: Happy Hour specials on pitchers of beer may include:\nFor Bud Light:  $5 pitchers between 5 p.m. – 6 p.m. (Promo 2), $6 pitchers between 6 p.m. – 7 p.m. (Promo 3), $8 pitchers between 7 p.m. – 8 p.m. (Promo 4)\nFor Yuengling:  $7 pitchers between 5 p.m. – 6 p.m. (Promo 2), $8 pitchers between 6 p.m. – 7 p.m. (Promo 3), $9 pitchers between 7 p.m. – 8 p.m. (Promo 4)\nSee: Create Promo Layers\nSet Up & Manage Promotions\nApply Promos\nWhat Type of Promo Should I Create?Last Updated: July 28, 2023\nLast Updated: July 28, 2023\nHow to Use PromosLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nManage Promo PreferencesLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nCreate Category Level PromosLast Updated: August 4, 2023\nLast Updated: August 4, 2023\nCreate Subcategory Level PromosLast Updated: August 8, 2023\nLast Updated: August 8, 2023\nCreate Mix & Match PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nCreate Promo LayersLast Updated: July 31, 2023\nLast Updated: July 31, 2023\nDeactivate Discounts and PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-item-level-promos/"
  },
  {
    "title": "Mark a Purchase Order as Paid",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tApril 30, 2021\nCompatible Version: 8.325Does your Exatouch look different? View prior release →\nUse the purchase order work area to mark Open, Open Sent, Pending (partially received), and Completed (received) purchase orders as Paid.\nFind and open or create a purchase order.\nTap Paid to mark the purchase order as paid.\nTap Yes to confirm — this change cannot be undone.\nTake other non-payment related actions, if needed.\n\n\nPurchase Order Management\nAdding & Managing Items\nCreate a Purchase OrderLast Updated: May 17, 2024\nLast Updated: May 17, 2024\nFind Purchase OrdersLast Updated: April 30, 2021\nLast Updated: April 30, 2021\nMark A Purchase Order as Complete and Inventory as ReceivedLast Updated: April 30, 2021\nLast Updated: April 30, 2021\nVoid a Purchase OrderLast Updated: April 30, 2021\nLast Updated: April 30, 2021\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/mark-po-as-paid/"
  },
  {
    "title": "Create a Purchase Order",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMay 17, 2024\nCreate Purchase Orders (POs) by selecting items to reorder from a vendor’s list of items.\n\nTip! Before you order items using an Exatouch purchase order, link an item to a vendor to populate the list of items for that vendor. Alternatively, add multiple items when you create a purchase order.\n\nFrom Home, navigate to Purchasing > PO Details.\n\nStart your PO by finding a vendor: Tap the search icon () to search by vendor name or scroll through a list of available vendors.\n\nSelect a vendor and bring up the vendor’s supply list.\nTap All items and Vendor items to toggle between items in this vendor’s list and all inventory items. \nTap an item to reorder, or tap Insert All to add to the purchase order.\nAccept the default quantity and cost, or edit the suggested quantity (required) and cost (optional) for each item. Tap OK to add this item to the PO.\nNote: Default Quantity and Cost Fields\nEdit the quantity and cost fields as needed. Quantity and and cost fields may be populated based on:\n\nItem details: Defined Reorder or Minimum Order quantities. Defined Cost.\nPrevious orders: Quantity and cost from the last purchase order.\nDynamic reordering: Calculated using an item’s Safe Qty, if enrolled. If an item’s Minimum Order Qty is higher than the number calculated by Exatouch, that number is used.\nNo previous orders or saved information: Quantity: 1.00, Cost: $0.00.\n\n\nTap Close to close this work area when you’ve added all the items for this vendor to the PO.\nTap to set Received and Expected dates if needed.\n\nEnter Sales Tax, if needed.\nFinish up your PO:\n\nTap Print to print this PO and change the status to Open.\nTap Save to save this PO and change the status Open.\nTap Send, if available, to send this PO to the email address in the vendor record, and change the status to Open.\nFrom Home, navigate to Purchasing > PO Details.\nStart your PO by finding a vendor: Tap the search icon () to search by vendor name or scroll through a list of available vendors.\nSelect a vendor and bring up the vendor’s supply list.\nTap All items and Vendor items to toggle between items in this vendor’s list and all inventory items.\nTap an item to reorder, or tap Insert All to add to the purchase order.\nAccept the default quantity and cost, or edit the suggested quantity (required) and cost (optional) for each item. Tap OK to add this item to the PO.\nNote: Default Quantity and Cost Fields\nEdit the quantity and cost fields as needed. Quantity and and cost fields may be populated based on:\n\nItem details: Defined Reorder or Minimum Order quantities. Defined Cost.\nPrevious orders: Quantity and cost from the last purchase order.\nDynamic reordering: Calculated using an item’s Safe Qty, if enrolled. If an item’s Minimum Order Qty is higher than the number calculated by Exatouch, that number is used.\nNo previous orders or saved information: Quantity: 1.00, Cost: $0.00.\nNote: Default Quantity and Cost Fields\nEdit the quantity and cost fields as needed. Quantity and and cost fields may be populated based on:\n\nItem details: Defined Reorder or Minimum Order quantities. Defined Cost.\nPrevious orders: Quantity and cost from the last purchase order.\nDynamic reordering: Calculated using an item’s Safe Qty, if enrolled. If an item’s Minimum Order Qty is higher than the number calculated by Exatouch, that number is used.\nNo previous orders or saved information: Quantity: 1.00, Cost: $0.00.\n\nItem details: Defined Reorder or Minimum Order quantities. Defined Cost.\nPrevious orders: Quantity and cost from the last purchase order.\nDynamic reordering: Calculated using an item’s Safe Qty, if enrolled. If an item’s Minimum Order Qty is higher than the number calculated by Exatouch, that number is used.\nNo previous orders or saved information: Quantity: 1.00, Cost: $0.00.\nTap Close to close this work area when you’ve added all the items for this vendor to the PO.\nTap to set Received and Expected dates if needed.\nEnter Sales Tax, if needed.\nFinish up your PO:\n\nTap Print to print this PO and change the status to Open.\nTap Save to save this PO and change the status Open.\nTap Send, if available, to send this PO to the email address in the vendor record, and change the status to Open.\nTap Print to print this PO and change the status to Open.\nTap Save to save this PO and change the status Open.\nTap Send, if available, to send this PO to the email address in the vendor record, and change the status to Open.\n\n\n\nMany of the work areas you use while creating a PO allow you to perform tasks related to inventory and purchasing. These tasks include:\nAdd a new vendor\nAdd new items to inventory\nAdd existing items to a vendor’s supply list\n\nExample: In this example, add a new vendor to Exatouch.\n\nTap New Vendors if the vendor you need isn’t in your existing list.\nAdd your new vendor’s information, then tap Save to save your changes. This adds the new vendor to your vendor list.\nTap the back arrow to return to the purchase order work areas and complete your tasks.\n\nExample: In this example, add a new item to inventory and the vendor supply list.\n\nTap Add New Item to add a new item.\nAdd your new item’s information, then tap Save to save your changes. This adds the new item to your inventory and links it to the selected vendor.\nTap the back arrow to return to the purchase order work areas and complete your tasks.\nIf you select a vendor with no items on their supply list, you are prompted to load all items. As you add each item to the purchase order, you add it to this vendor’s supply list.\n\nExample: In this example, add soup to a vendor that has no items on their supply list.\n\nTap Yes to load all items.\nSelect an item and tap it to add to the purchase order. Tap Yes to add it to the purchase order and vendor’s list of items.\nContinue adding items and complete your purchase order tasks.\n\nExample: In this example, add coffee to a vendor supply list.\n\nTap All Items to switch from the vendor’s supply list to a list of all items in your inventory.\nUse Search to narrow the list, or use Category and Subcategory to narrow the list of items shown.\nSelect an item and tap it to add to the purchase order. Tap Yes to add it to the purchase order and the vendor’s list of items.\nContinue adding items and complete your purchase order tasks.\n\nClick here to schedule your software update today!\nPurchase Order Management\nCreate Quick Purchase Orders (PO)Last Updated: August 29, 2024\nLast Updated: August 29, 2024\nEmail a PO to a VendorLast Updated: April 30, 2021\nLast Updated: April 30, 2021\nLow Level Quantities in the RegisterLast Updated: May 7, 2024\nLast Updated: May 7, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-a-purchase-order/"
  },
  {
    "title": "Create Subcategory Level Promos",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tAugust 8, 2023\nCompatible Version: 8.302Does your Exatouch look different? View prior release →\nPromos can be applied to a group of items that share a Subcategory within a category. Run Subcategory Level Promos during specific hours during the day, for a specific time period.\n\nFrom Home, navigate to Items > Categories.\nSelect a Category and/or Subcategory. Scroll through the Category and Subcategory work areas as needed.\n\nTip! Users can select only the parent Category, if desired. When selecting a parent Category, the promo applies to all children Subcategories.\nTip! If the category or subcategory you need is not in your system, create them and add the appropriate items to the each. See: Create Categories and Subcategories.\nSelect the On Sale checkbox to activate the sale pricing work area for items in this Subcategory.\nIn the Buy field, enter the number of items a customer needs to purchase to receive the promotion. Until this number of items is purchased, this Promo will not apply to their purchase.\nSelect a promo, and then add any extra information for the promo, such as Dollar or Percentage amount.\n\nNote: Discounts apply to the lowest priced item sold as part of the promotion.\nOptional: Enter the maximum number of promos per transaction a customer can purchase in the Max Per Trx field.\nOptional: Select Date and Time information to define when this promo runs.\n\nExample: This promo only runs the last week of December.\n\nEnable one or more days of the week for this promo. At least one day must be enabled for the promo to run.\nTap Save. This promo is now active for all items in this Subcategory during the days and times you’ve configured.\n\n\nBuy: Enter the amount of items a customer much purchase to qualify for discounts/promotions.\nPromo: Select the desired promotion from the drop-down menu.\nGet one free: Purchase the number of items in the Buy field to receive an additional item free. Customers must buy at least one eligible item to receive the Get one free promo item. The free item must be of equal or lesser value than other eligible items.\nGet one half price: Purchase the number of items in the Buy field to receive an additional item at half price. Customers must buy at least one additional eligible item to receive the half-price promo. The half-price must be of equal or lesser value than other eligible items.\nGet one for percentage off: Buy one item and receive a second for a percentage off. Enter the discount amount, up to two decimal places, in the Percentage off field.\nFor dollar amount: Buy one item and receive a fixed dollar amount discount on the second item. Enter the discount amount, up to two decimal places, in the Dollar Amount field.\nFor percentage off: Buy one or more items for a percentage off the original purchase price. The purchase of only one item is required to receive this promo. Enter the discount amount, up to two decimal places, in the Percentage off field.\nFor dollar amount off: Buy one more items and receive a fixed dollar amount discount on the item(s). Enter the discount amount, up to two decimal places, in the Dollar Amount field.\nMax Per Trx: Enter the maximum amount of the item a customer can buy per transaction (e.g., a merchant may limit quantities sold to prevent the item from selling out too quickly).\nStart Date: Select the date the discount/promotion begins\nEnd (Date): Select the date the discount/promotion ends.\nDaily Time Start: Select the time the discount/promotion begins.\nEnd (Time): Select the time the discount/promotion ends.\n\nNote: Promos with a set end date and/or time will expire automatically. Nevertheless, promos can be deactivated at any time. See: Deactivate Discounts and Promos.\n\nDay(s) of the Week: Select the day(s) for when the promotion runs. Default: All.\n\n\nSample promotion settings:\n\nExample: Liquor Store – New Year’s Special: 10% off all Champagne selections the last week in December.\n\n\nExample:  Salon and Spa – Deep Conditioning Wednesdays: Buy two Moroccan Oil Treatments, get one more free every Wednesday in February.\n\n\nExample:  Restaurant – TGIFries-Day Special: Purchase any type of fries for $2.00 on Fridays from 4 p.m. – 9 p.m.\n\n\n\nCheck your work by ringing up Promo Items in the Register app.\nItems sold with a promotional discount are shown in a Green font.\nItems sold at regular price are shown in a Black font.\nThe total amount of the Promo discount is shown as a separate line item in the Totals area.\nDiscounts are displayed in the Register app by default. Admins can change this setting in Register Preferences. See: Manage Promo Preferences\n\nSet Up & Manage Promotions\nApply Promos\nWhat Type of Promo Should I Create?Last Updated: July 28, 2023\nLast Updated: July 28, 2023\nHow to Use PromosLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nManage Promo PreferencesLast Updated: July 28, 2023\nLast Updated: July 28, 2023\nCreate Item Level PromosLast Updated: August 2, 2023\nLast Updated: August 2, 2023\nCreate Category Level PromosLast Updated: August 4, 2023\nLast Updated: August 4, 2023\nCreate Mix & Match PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nCreate Promo LayersLast Updated: July 31, 2023\nLast Updated: July 31, 2023\nDeactivate Discounts and PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-subcategory-level-promos/"
  },
  {
    "title": "Menu Building for Restaurants",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 1, 2024\nThe Exatouch Point of Sale (POS) system allows restaurants to quickly build menus to maximize efficiency when processing sales.\nTo download a PDF copy of this information, click here.\nPerform the following to build menus in Exatouch:\n\nMenu building takes place within the Items module, which is located on the Home screen. Navigate to the Home screen by tapping the Home button at the bottom of most Exatouch screens.\nTapping the Item List module displays all items and modifiers added into the Exatouch POS. From Home, navigate to Items > Item List.\nTapping the Item Details module displays the Item Details page, where users can create items, add categories and subcategories, assign modifiers, and perform other item functions. From Home, navigate to Items > Item Details.\nTapping the Categories module displays Categories work area, where users can create categories and subcategories. From Home, navigate to Items > Categories.\n\n\nBegin building a menu by first organizing items and services into categories and subcategories. Categories and subcategories help merchants find items more easily in the Register app.\nFrom Home, navigate to Items > Categories.\nTap New Category to start a new category.\nEnter a Description, and then select a category type: Items category or Services category.\nSelect the Visible on Register checkbox.\nTap Save.\nRepeat as needed to create additional categories.\nFrom Home, navigate to Items > Categories.\nSelect a category, tap None in the Subcategories work area, and then tap New subcat to start a new subcategory.\nEnter a Description name.\nTap Save to save the subcategory.\nRepeat as needed to create additional subcategories.\n\nNote: Saving a subcategory returns users to the Items screen. Tap the Categories module to continue adding subcategories.\n\n\n\nAfter creating categories and subcategories, add root items to associate with categories and subcategories.\nFrom Home, navigate to Items > Item Details.\nTap the Details tab.\nEnter a SKU number in the SKU field or tap the SKU icon to auto-generate a SKU. In Exatouch, random SKU numbers are assigned to newly created items for identification purposes.\nIn the Item Name field, enter a name for the item. The item name populates in several fields below.\nEnter a price in the Price field.\nSelect a Category and Subcategory (if applicable) for the item.\nTap Save.\nMerchants should also verify that proper tax rates are enabled.\nOn the Item Details screen, tap the Tax & GL tab.\nIn the Tax Groups section, adjust the sliders to enable or disable desired tax settings.\n\nTip! For detailed tax group configuration, see Set General Tax Rates.\n\nTap Save.\n\n\nA modifier is an item which further describes or amends a customer’s order. Modifier creation follows the same process as creating a root item.\nFrom Home, navigate to Items > Item Details.\nTap New, then create a SKU number.\nEnter a modifier name in the Item Name field.\nSelect the Category and Subcategory from the dropdowns.\nEnter a price in the Price field. If there is no charge, enter 0.00.\nToggle the Modifier slider to enable the modifier.\nTap Save.\nMerchants can also assign a cost to modifiers, such as adding extra cheese or bacon to a hamburger.\nFrom Home, navigate to Items > Item Details.\nCreate a modifier.\nEnter a Price for the modifier.\nSelect the Category and Subcategory.\nTap the Modifiers tab.\nEnter the item price in the Price and Modifier Price: $ fields.\n\nNote: Modifier Price is the amount charged to the customer in the Register. The Price field represents the dollar value that displays in the Price $ column of the Items List page. This helps merchants to differentiate items in inventory.\n\nTap Save.\n\nMerchants can attach modifiers either individually to an item or in groups via subcategories.\nAttach modifiers to root items selected from the Items List screen. This method is more suited to smaller, less complex menus.\nFrom the Item Details screen, tap All Items. The Items List screen displays.\nNote: You can also access the Items List from the Home screen, and then navigating to Items > Items List.\nSelect a root item from the Items List screen. The Item Details screen displays.\nTap the Modifiers tab.\nTap Add New Modifier.\nSelect a modifier to attach.\n\nTip! Use the Search field to narrow the list of available modifiers.\n\nTap Close. The modifier displays as attached to the root item.\nTap Save.\nRepeat as necessary to attach more modifiers.\nAttaching modifiers by subcategories allows users to build larger menus more quickly and efficiently than attaching a single modifier to a single item.\nOn the Item Details page, tap Modifiers.\nSelect a category from the Categories work area.\nSelect a subcategory from the Subcategories work area.\nTap the Subcategory arrow. Modifiers associated with the subcategory attach to the item.\nTap Save.\nRepeat as necessary to add more modifiers.\nMerchants can further organize modifiers in the Register by assigning them to groups.\nSelect an item.\nTap Modifiers.\nIn the Required column of the modifier work area, select a group name from the dropdown to assign to a modifier.\nAssign the same group name to other modifiers in the same subcategory. For example, select Group A for all Temp modifiers.\nTap Save.\nBy default, users can select one modifier per modifier group. The Manage Group function allows users to select multiple modifiers for the same group. This gives users more flexibility when ringing up an item.\nFrom the Item Details screen, tap Manage Group. A popup displays.\nIn the Description column, rename group names (if desired).\nIn the Minimum column, the minimum number of modifiers to apply. Enter 0 to account for plain orders.\nIn the Maximum column, enter the maximum number of modifiers to apply. For example, to allow up to five modifiers, enter 5.\nTap OK to return to the Item Details page.\nTap Save.\nVerify Manage Group settings in the Register.\n\n\nFor assistance with menu building, contact our 24/7 Technical Support Team at (800) 966-5520 – Option 3 or email us at support@electronicpayments.com.\nClick here to schedule your software update today!\nMenu Setup & Management\nMenu & Inventory Management\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/menu-building-for-restaurants/"
  },
  {
    "title": "Modify Inventory Levels",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJune 8, 2023\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nInventory levels for your items are maintained by Exatouch: every sale, return, inventory count, and shipment acceptance affects your on-hand stock. Adjust quantity levels for single items outside of these workflows in Item Details.\nEdit an item record directly to add or remove inventory outside of the usual retail workflows of selling, buying, and inventory maintenance.\nFrom Home, navigate to Items > Item List.\nSelect an item. The Item Details screen displays.\nTap the Inventory tab.\nIn the Stock Type section, perform one of the following:\nInventory Item: Tap to enable inventory tracking.\nNon-Inventory: Tap to disable inventory tracking.\nTap Save.\n\n\nMerchants can adjust inventory either under the Inventory Adjustment tab or within the Items Count submodule.\nFrom the Item Details screen, tap the Inventory Adjustment tab.\nTo increase item quantity, perform the following:\nIn the Qty To Add field, enter the number of items to add.\nEnter an Adjustment Reason in the workspace (e.g., Received a new shipment).\nNote: If you do enter an Adjustment Reason, Exatouch prompts you to do so. The reason for an inventory change displays in inventory reports.\nTap Save.\nTo decrease item quantity, perform the following:\nIn the Qty To Remove field, enter the number of items to remove.\nEnter an Adjustment Reason in the workspace (e.g., Returned a surplus).\nTap Save.\nFrom Home, navigate to Items > Count.\nOn the Items Count screen, tap Add Items. The Item List screen displays.\nScan the item(s) or on the Item List screen, or tap the item the desired number of times, then tap Close. For example, tap the item five times to add five items.\nNote: Users can also manually enter items.\nThe item displays on the Item Count screen, and the quantity added displays in the Qty column.\nTap Save to save your progress.\nRepeat steps 2-5 as desired. When finished, tap Reconcile.\nTap Yes to confirm. The Reconciled Items screen displays.\n\nTip! On the Reconciled Items screen, users can remove an item after it’s been reconciled by performing the following:\n\nAfter reconciling an item, the Reconciled Items screen displays.\nDeselect an item’s checkbox in the Selected column.\nEnter a reason for reversing the item reconciliation in the Note field.\nTap Process.\nTap Yes to confirm.\n\nAfter reconciling an item, the Reconciled Items screen displays.\nDeselect an item’s checkbox in the Selected column.\nEnter a reason for reversing the item reconciliation in the Note field.\nTap Process.\nTap Yes to confirm.\n\n\nMerchants can track inventory trends over time by reviewing the Inventory Audit and Inventory Movement reports.\nFrom Home, navigate to Reports > Items.\nTap Inventory Audit.\nSelect a date range from the Range drop-down menu, then tap Run.\nThe Inventory Audit report displays.\nFrom Home, navigate to Reports > Items.\nTap Inventory Movement.\nTap the magnifying glass icon next to the Item field. The Item List screen displays.\nSelect an item to add, then tap OK.\nSelect a date range from the Range drop-down menu, then tap Run.\nThe Inventory Movement report displays.\n\n\nMenu Setup & Management\nInventory Setup & Management\nAdding & Managing Items\nModify Item Stock Type — Inventory or Non-InventoryLast Updated: March 10, 2021\nLast Updated: March 10, 2021\nLink Items to VendorsLast Updated: May 3, 2024\nLast Updated: May 3, 2024\nAdd an ItemLast Updated: August 29, 2024\nLast Updated: August 29, 2024\nAdd a VendorLast Updated: March 10, 2021\nLast Updated: March 10, 2021\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/modify-inventory-levels/"
  },
  {
    "title": "Modify Items In Bulk",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJuly 15, 2023\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nSave time and effort by quickly modifying groups of items in bulk. Change prices, categories, and more. Create a list of items using advanced search, then use Modify All List Items to make your changes.\nNote: Changes in federal banking regulations may result in adjustments to the EBT, dual pricing, and tender discount features.\n\nMany Modify All List Items settings utilize sliders that operate according to a three-way toggle system. Tapping the slider the desired number of times toggles it between inactive, active (disabled), and active (enabled). By default, the sliders display as inactive. The following table describes the various slider settings.\n\n\nFrom Home, navigate to Items > Item List.\nOn the Items List page, tap Advanced Item Search.\nSelect the desired filters from the pop-up screen, then tap Search.\nReview search results, then tap Modify All List Items.Warning: Group items together using the Advanced Item Search button before using the Modify All List Items feature.\nWarning: Group items together using the Advanced Item Search button before using the Modify All List Items feature.\nIn the work area that displays, enter any revisions as desired, then tap OK. In this example, the merchant configures Exatouch to make all seafood items non-refundable.\nConfirm and re-confirm any changes. Tap No to abort the function.\nSelect any item in your temporary group of items to view your changes in the item’s record.\nScroll through your group of items by tapping one of the following:\nFirst Item: Displays first item in group\nPrev Item: Displays previous item in group\nNext Item: Displays next item in group\nLast Item: Displays last item in group\nAll Items: Displays all items in Exatouch\n\n\nNote: Service Items can also be modified in bulk. See: Modify Bulk Services\n\nApply price changes in bulk. Increase or decrease the price of a group of items by dollar amount or by percentage.\n\nExample:  Raise prices by a percentage amount –  A retailer offers cash discounts of 3.5% on in-house brand items and wants to adjust pricing to reflect cash prices. \n\nBegin by grouping all applicable in-house brands.\nIn the Modify All List Items work area, enter 3.50 in the Price field.\nTap the slider until it toggles toward the plus sign (+) setting.\nSelect the percentage (%) bubble.\n\nBegin by grouping all applicable in-house brands.\nIn the Modify All List Items work area, enter 3.50 in the Price field.\nTap the slider until it toggles toward the plus sign (+) setting.\nSelect the percentage (%) bubble.\n\n\n\nExample:  Lower prices by a dollar amount –  A liquor store gets a large discount from their new provider of beer kegs and lowers its retail price by 5%. The store offers cash discounts and wants to adjust pricing to reflect cash prices.\n\nBegin by grouping affected items in the Keg category.\nIn the Modify All List Items work area, enter 5.00 in the Price field.\nTap the slider until it toggles toward the minus (-) setting.\nSelect the dollar sign ($) bubble.\n\nBegin by grouping affected items in the Keg category.\nIn the Modify All List Items work area, enter 5.00 in the Price field.\nTap the slider until it toggles toward the minus (-) setting.\nSelect the dollar sign ($) bubble.\n\n\n\n\nMerchants can also apply promotions quickly and easily to grouped items. After creating a group, navigate to the Modify All List Items work area and tap the Promo tab. Set up and apply your promotion to your grouped items as you would for a single item.\n\nNote: Depending on your Exatouch configuration, not all fields may be available.\n\nConfigure the following, as desired:\nExclude From Discounts: Enable or disable to exclude an item group from discounts.\nAllow Discount: Enable or disable to define the item group’s discount status.\nExclude From Promotions: Enable or disable to exclude an item group from promotions.\nAllow Promotions: Enable or disable to define the item group’s promotion status.\nOn Sale: Select to enable discount and promotion settings.\nBuy: Enter the amount of items a customer must purchase to qualify for discounts/promotions.\nPromo: Select the desired promotion from the drop-down menu.\nMax Per Trx: Enter the maximum amount of the item a customer can buy per transaction (e.g., a merchant may limit quantities sold to prevent the item from selling out too quickly.)\nStart Date: Select the date the discount/promotion begins.\nEnd: Select the date the discount/promotion ends.\n\nTip! Select specific dates for when the discount/promotion is applied by selecting the appropriate checkbox. For example, select Tue and Thu to offer the discount/promotion on Tuesdays and Thursdays only. Default: All.\n\nDaily Time Start: Select the time the discount begins.\nEnd: Select the time the discount/promotion ends.\nExclusive For: Select the desired club membership level(s) to receive club discounts/promotions.\nPromotions: Select the desired promo layers and add a discount/promotion price for each item group.\nPromo 2: Select to enable and enter promo layer for Promo 2.\nPromo 3: Select to enable and enter promo layer for Promo 3.\nPromo 4: Select to enable and enter promo layer for Promo 4.\n\nNote: See Happy Hour Specials: Use Promo Layers for details on creating promo layers.\nNote: Historical Pricing can be applied to groups of items. See: Historical Pricing.\n\nTip! You can also apply promotions quickly and easily to your grouped items. Create your group, then navigate to Modify All List Items > Promo tab. Set up and apply your promotion to your grouped items as you would for a single item.\n\n\n\nNote: Historical pricing can be applied to group of items. See: Historical Pricing.\nMenu Setup & Management\nInventory Setup & Management\nAdding & Managing Items\nModify Bulk ServicesLast Updated: September 25, 2023\nLast Updated: September 25, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/modify-bulk-items/"
  },
  {
    "title": "Find an Item",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 12, 2024\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nUse the Register app to search for an item and add it to an order. Users with appropriate access levels can find items to get more information about an item, add or remove inventory for an item, or make individual or bulk make changes to items.\n\nTap the Find Items button in the Register app to open an item search area.\nUse the various search options to narrow your results.\nTap an item to add it to your existing order.\nAlternatively, tap Insert All to add all items returned by your search to the order.\nTap the Find Items button in the Order Details work area to open an item search area.\nUse the various search options to narrow your results.\nTap an item to add it to your existing order.\nAlternatively, tap Insert All to add all items returned by your search to the order.\nUse the search tools find your item. Simply scroll through the list of items or your listed search results using the green arrows, or narrow the item list by using one or more search filters.\nSearch: Tap a column heading to search for items based on information in that column. Enter a full or partial search term in the Search field to return matching results.\n\nExample: Tap the Size column and enter 20 fl oz in the Search field to return matching items.\n\nFilter by Category and Subcategory: Select a category and subcategory to restrict a search to items in those categories.\n\nExample: Select the Category Beverages and the Subcategory Iced Teas to look through or Search for items in those categories.\n\nEnable Only modifiers to restrict your search to items defined as modifiers.\n\nAs an added convenience, tap Add New Item to add a new item to Exatouch. A manager’s PIN may be required.\n\n\nFrom Home, navigate to Items > Item List to view inventory and menu items.\nScroll to find and tap an item to see the item’s details.\nUse search tools to find specific items.\n\n\nNote: Users with appropriate access levels can find items to get more information about an item, add or remove inventory for an item, or make individual or bulk make changes to items.\n\n\n\nScroll through the list of items or your listed search results using the green arrows, or narrow the item list by using one or more search filters.\nSearch: Tap a column heading to search for items based on information in that column. Enter a full or partial search term in the Search field to return matching results.\n\nExample: Tap the Size column and enter 6 pk in the Search field to return matching items.\n\n\n\n\nNote: Users with appropriate access levels can find items to get more information about an item, add or remove inventory for an item, or make individual or bulk make changes to items.\n\n\nAdvanced Item Search allows you to look for items that meet one or more specific requirements. Tap Advanced Item Search to open up a new advanced search work area.\n\nEnter a full or partial term in the Search Key: field, and select one or more options to narrow your search from your entire inventory to a smaller group of items.\nAll fields are optional; you can design your search to return items that meet one or more selections.\n\nSearch Key: Enter a full or partial term. If left blank, you can return items based on the other search options you select.\nCategory – Select a category of items to search, such as Entrees or Floral.\nSubcategory – Select a subcategory of items to search, such as Pasta, Burgers, Cut Flowers, or Holiday Arrangements. You must also select a category.\nPrice:  Enter a retail price in dollars and cents (such as 5.99).\nSize: Select a size, if used, from size types you use for your items to search, such as 16 fl oz, 6 pk, dozen, 222 ml, medium, or one size.\nColor: Select a color, if used, from the colors you use for your items to search, such as Red, Blue, or Rainbow.\nStyle: Select a style, if used, from the styles you use for your items to search, such as Child, Unisex, Cat, or Bird.\nRev. Center: Select a Revenue Center from those defined for your business.\nRev. Class: Select a Revenue Class from those defined for your business.\nManufacturer: Select a Manufacturer from those assigned to your items to search.\nMfg Part: Enter a part number, if assigned, to your items to search.\nDefault Item Field – Select a custom field, if used and assigned, to your items to search. This field may have a different name based on your Exatouch settings.\nCustom Field 2 – Select a custom field, if used and assigned, to your items to search. This field may have a different name based on your Exatouch settings.\nCustom Field 3 – Select a custom field, if used and assigned, to your items to search. This field may have a different name based on your Exatouch settings.\nVendor: Select a Vendor from those assigned to your items to search.\nNeed To Reorder – Enable to restrict results to items that have reached their defined low level quantity.\nSelect your search parameters, then tap Search to find your items.\nExample: Search for items in the Category Beverages and enable Need To Reorder. Exatouch returns all Beverages items that need to be reordered.\n\n\n\nTap Clear Search Results to clear your search results when you are done working with item search and adjustments.\nTap Modify All List Items to make specific changes to all items returned by your search.\nTap Print List to print a list of your search results.\nTap Report to open a report work area. Generate reports based on your search results.\nNote: Users with appropriate access levels can find items to get more information about an item, add or remove inventory for an item, or make individual or bulk make changes to items.\n\n\nSwitch to searching for an item or groups of items at any time while you work in the Items Detail work area.\nTap All Items (visible in all work areas) at any time to switch to the Item List.\nIf you’ve recently run a search and not cleared the results, the results of your last search may display in the Item List.\nTap Clear Search Results to start a new search.\n\nNote: Users with appropriate access levels can find items to get more information about an item, add or remove inventory for an item, or make individual or bulk make changes to items.\n\n\nNot your version? See: Find an Item – Prior Releases\nMenu Setup & Management\nInventory Setup & Management\nUsing the Register App – Advanced\nAdding & Managing Items\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/find-an-item/"
  },
  {
    "title": "Prepare Your Inventory and Menu Items for DeliverMe Online Ordering",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 12, 2024\nCompatible Version: 8.310\nAs you plan what inventory and menu items you’re going to offer through your DeliverMe online ordering site, here are a few things to keep in mind: Do your items pack up and travel well? Do you want to offer items a la carte or as combinations? Do you have appealing photos of your items to include online? Do items have helpful descriptions to anticipate your customers questions? How do modifiers (if any) work with your menu items?\nYour DeliverMe online ordering site is a flexible, easy to use platform for you and your customers. Easily add and remove items from your online ordering site, manage orders as they are seamlessly queued in DeliverMe, and start and stop ordering as needed to manage your day to day sales.\n\nYour site, set up by your Support team, will have a unique site address for your business. Information about your business is a mix of static and changing information.\n\nSite header image  – Up to 1200 pixels by 1200 pixels. Uploaded by Support.\nSite logo – Up to 800 pixels by 800 pixels. Uploaded by Support.\nPickup and Delivery hours* – Reflects the hours you set in Exatouch. Update in Exatouch > Settings > Register Preferences > Delivery tab.\nOrder Wait time* – Reflects the Order Build time you set in Exatouch. If you have set two different build times, the longer build time is shown here. Update in Exatouch > Settings > Register Preferences > Delivery tab.\nNote: If a customer views your site when delivery or pickup hours are closed (scheduled or temporary), this is replaced by a message that ASAP orders are not available. Customers can place an order for a future available date and time.\nNote: If a customer views your site when delivery or pickup hours are closed (scheduled or temporary), this is replaced by a message that ASAP orders are not available. Customers can place an order for a future available date and time.\nLocation Address – Defined in Exatouch > Settings > Business Details by Support.\nMore Info* – This link opens an information pop up with more detailed information about your scheduled delivery hours, pickup hours, and wait times. Update in Exatouch > Settings > Register Preferences > Delivery tab.\nLocation Phone Number – Defined in Exatouch > Settings > Business Details by Support.\nOrder Minimum* – Reflects the Min. Order you set in Exatouch. Update in Exatouch > Settings > Register Preferences > DeliverMe tab.\nDelivery Fee* – Reflects the Delivery Fee you set in Exatouch. Update in Exatouch > Settings > Register Preferences > Delivery tab > DeliverMe Preferences.\nMenu Categories* – These reflect the categories items you offer online.\nNote: Starred (*) fields updated in Exatouch push to your online ordering site where applicable within a minute or two of you saving your changes. Changes you make do not affect orders currently in the order queues.\nYou can flexibly offer as few or as many menu or retail items you have set up in your Exatouch system. Our support team can help you plan your rollout as you decide what to offer first—then you can add items at your own pace.\nAll item information is pulled from your Item Details record (Home > Items > Item Details > Details tab). Most of the information you need is already there, and we’ve added a toggle you can use (Make Available Online?) to control the item’s online availability.\nCaution: Before you make significant changes to your items in Exatouch, make a backup of your database.\nSome fields for your items may be mostly ready to put online. Some may have limited information, in an easy shorthand for your staff. Use the handy guide here to understand which fields you can update before (and after) you offer an item on your DeliverMe online ordering site.\nExample:  An item with an Item Name such as Ahi-app should be updated to a customer-friendly name like Ahi Tuna, and given a description of Blackened tuna served rare, wasabi creme fraiche, sweet soy-chili glaze and scallions.\n\nTo ease the transition for your customers, use the familiar names and descriptions they are used to seeing when they visit you in person. Pick up descriptions from your menu, or briefly describe important features of retail items, such as color and content.\nItem Name* – The brand or friendly name of an item.\nDescription* – A longer description of an item, such as the ingredients, toppings, or uses.\nPrice* – The retail price of the item before fees and taxes are applied.\nCategory – The category this item is grouped by. The order of categories can be changed in your online ordering site after you’ve loaded your items.\nImage – This is the image, max 800 pixels by 800 pixels, of an item. See the section Image Management in this article.\nMake Available Online?* – Enable to make an item available online. Disable to remove the item for sale online.\nItem is a Modifier – See the section Manage Modifiers in this article.\nSticky Label Print Description* – A short friendly item name you print on a sticky label to affix to a specific item, such as Vegetarian Sub or Onion Soup. This helps you match and manage all items in an order.\nAge Check* – Select yes to prompt for an age check on this item. Select no to skip an age check for this item.\nItem Name* – The brand or friendly name of an item.\nDescription* – A longer description of an item, such as the ingredients, toppings, or uses.\nPrice* – The retail price of the item before fees and taxes are applied.\nCategory – The category this item is grouped by. The order of categories can be changed in your online ordering site after you’ve loaded your items.\nImage – This is the image, max 800 pixels by 800 pixels, of an item. See the section Image Management in this article.\nMake Available Online?* – Enable to make an item available online. Disable to remove the item for sale online.\nItem is a Modifier – See the section Manage Modifiers in this article.\nSticky Label Print Description* – A short friendly item name you print on a sticky label to affix to a specific item, such as Vegetarian Sub or Onion Soup. This helps you match and manage all items in an order.\nAge Check* – Select yes to prompt for an age check on this item. Select no to skip an age check for this item.\nNote: Starred (*) fields updated in Exatouch push to your online ordering site where applicable within a minute or two of you saving your changes. Changes you make do not affect orders currently in the DeliverMe queues.\n\nYour DeliverMe online ordering site includes a header image, your logo image, and images for each item.\nHeader image:  An image you provide to Support can be up to 1200 pixels by1200 pixels. Use it to showcase your business, highlight specialty items, and make your customers feel welcome.\nLogo image: The image you provide to Support can be up to 800 pixels by 800 pixels. It is shared on your online ordering site alongside your other business information, and assures your return customers they are ordering from your DeliverMe online ordering site.\nMenu Item and Inventory Images: For best results, select attractive, representative images 800px by 800px in size.\nAs you update items in Exatouch to build out your DeliverMe online ordering site, you’ll be able to add images for each item. Your items are organized online by category; to make keeping track of each images easier, group your items in folders based on category. Use a readable name for each item, such as beer-bottle-bud.jpg, enchilada-dinner.png, and cool-ranch-dorito-20oz.jpg.\nTo add images to your items listed in DeliverMe online ordering site, log in as administrator, and update each item by dragging and dropping each image on each item record.\nLog in to your DeliverMe site as the administrator.\nTap or click your name to open the site navigation menu.\nTap or click Settings. A DeliverMe merchant settings work area opens.\nTap or click Category and Item Management, then navigate to an item.\nClick and drag your item’s image to the Drop 800×800 image here. You’ll be able to see the image before you save your work and make it available online.\nTap or click Save Item to save the image for this item.\nRepeat as needed for each item.\n\n\nThe modifiers and modifier groups you’ve set up for your menu items in Exatouch are available in your DeliverMe online ordering site. All of the modifier information is pulled from your Item Details record (Home > Items > Item Details > Details tab). Most of the information you need is already there.\n\nCaution: Before you make significant changes to your items in Exatouch, make a backup of your database.\n\nSome fields for your modifiers may be ready to put online. Some may have limited information, in an easy shorthand for your staff. Use the handy guide here to understand which fields you can update before (and after) you offer an item on your DeliverMe online ordering site.\n\nItem Name* – The brand or friendly name of an item.\nPrice* – The retail price, if any, of the item before fees and taxes are applied.\nNote: Starred (*) fields updated in Exatouch push to your online ordering site where applicable within a minute or two of you saving your changes. Changes you make do not affect orders currently in the DeliverMe queues.\nNote: Starred (*) fields updated in Exatouch push to your online ordering site where applicable within a minute or two of you saving your changes. Changes you make do not affect orders currently in the DeliverMe queues.\nThe other fields that affect your modifiers include:\nCategory – Mods. The category must be Mods and attached to your items as needed to show up on your DeliverMe online ordering site.\nSubcategory – Usually the name of the modifier group for this item.\nItem is a Modifier – Enable to allow this item to be used as a modifier.\nMake Available Online?* – Disable, and leave disabled. The item will appear online as a modifier to an individual sale item.\nUnlike your menu and inventory items, do not enable Make Available Online?. This item appears online as a modifier to an individual sale item, as needed.\n\n\nMenu Setup & Management\nInventory Setup & Management\nSet Up Expanded Pickup, Delivery, and DeliverMe Online Ordering OptionsLast Updated: March 19, 2021\nLast Updated: March 19, 2021\nExpanded Delivery Management Tools and DeliverMe with Online Ordering!Last Updated: March 19, 2021\nLast Updated: March 19, 2021\nAdd an ItemLast Updated: August 29, 2024\nLast Updated: August 29, 2024\nDuplicate Items and ModifiersLast Updated: January 4, 2024\nLast Updated: January 4, 2024\nSimplified Customer Search in Delivery ManagerLast Updated: April 24, 2024\nLast Updated: April 24, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/prepare-your-inventory-and-menu-items-for-deliverme-online-ordering/"
  },
  {
    "title": "Modify Bulk Services",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tSeptember 25, 2023\nGroups of Services can be modified in bulk, making price modification and category changes a breeze! Use the Modify All List Services function to accomplish these tasks.\nGroup a list of services together in the Service List module. Then use Modify All List Services to apply changes to the group.\nFrom Home, navigate to Items > Service List.\nUse the Search field or Advanced Services Search button to gather a group of services together.\nView the services displayed, scrolling through the entire list to confirm that all services are intended.\nTap Modify All List Services.\nEnter any changes. See a detailed list of options below.\nTap OK.\nWhen prompted to confirm modifying all list services, click Yes to confirm. This prompt displays twice.\nEnter an Admin PIN, if prompted, to finalize changes.\nChanges display within each service record.\n\n\nPrice changes can be applied in bulk. Exatouch gives you the ability to either increase or decrease the price of a group of services in dollar increments or by percentage.\nThese are settings for bulk price changes:\nRestaurant Scenario 1: A popular restaurant is increasing the price of its catering services by $10. The word “Catering” is entered in the Search field to gather a list of catering services. Prices are increased by $10 per service item on the Modify All List Services tab using these settings. The merchant enters 10.00 in the Price field, then enables the plus sign (+) slider:\n\n\nThese options may be applied in bulk to a group of services:\nTime:  Scheduled time slots can be applied in bulk, which saves merchants valuable time.Example: A salon sets up times for various services so they can be scheduled effectively. They determine that all men’s and boys’ cuts take 15 minutes. Instead of applying a 15 minute slot to each individual service, generate a list of all men’ and boys’ cuts using Advanced Services Search. They use Modify All List Services to apply a 15 minute time unit to all those services. These are the settings applied:\nExample: A salon sets up times for various services so they can be scheduled effectively. They determine that all men’s and boys’ cuts take 15 minutes. Instead of applying a 15 minute slot to each individual service, generate a list of all men’ and boys’ cuts using Advanced Services Search. They use Modify All List Services to apply a 15 minute time unit to all those services. These are the settings applied:\nPrice: Prices increase or decrease in dollar increments or percentage increments\nCategory\nSubcategory\nUser Defined Reporting: Drive to report: Choose “Business Overview Report” and/or “Snapshot Reports” to display data for the selected list services.\nTax: Taxes can be applied in bulk to select services. Choose which tax group. General taxes, per unit taxes, and pre or post-taxes can be applied in bulk. Tax settings are defined in Settings. See: Set General Taxes Example: Scenario 2: The state has enacted a new tax for all salon and spa services. Salons can easily apply this tax to all their services by using Modify All List Services. After displaying a list of all services in Services List, select Modify All List Services and apply Tax Group A: Florida Tax. These are the settings:\nExample: Scenario 2: The state has enacted a new tax for all salon and spa services. Salons can easily apply this tax to all their services by using Modify All List Services. After displaying a list of all services in Services List, select Modify All List Services and apply Tax Group A: Florida Tax. These are the settings:\nVisible on register\nDisplay color\nRefundable\nCash Discount: Enable cash discounting for a group of services by enabling this setting. See: Enable Cash Discounts\n\nTip!  Promos are easy to apply to a group of service items! Bulk Promos are a subset of Modify All List Services located on the Promo tab. After tapping Promo, configure bulk promo settings as desired. For more information on creating Item-Level Promos for service items, see: Create Item Level Promos\nNote: Historical pricing allows merchants to view current and historical pricing, and can be applied to a group of services. Historical Pricing is a subset of Modify All List Services, located on the Historical Pricing tab. See: Historical Pricing\nAlso see: Modify Bulk Items\nClick here to schedule your software update today!\nMenu Setup & Management\nServices\nAdding & Managing Items\nWhat is a Service Item?Last Updated: March 10, 2021\nLast Updated: March 10, 2021\nModify Items In BulkLast Updated: July 15, 2023\nLast Updated: July 15, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/modify-bulk-services/"
  },
  {
    "title": "Add Modifiers to an Item",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tSeptember 27, 2023\nOnce a modifier is created and defined, the modifier (aka mod) can be added to an item.\nMODs can be added to a category of items, to a single item, or to all items.\nFrom Home, navigate to Items > Item Details.\nTap the Details tab.\nVerify that the correct record displays. If not, tap All Items to find another item. See: Find an Item\nTap the Modifiers tab.\nSelect a Category from the Categories list to add to the Modifies These Items section. Tap the Arrow to move your choice over to the list. For example, select Mods and move it to the Bleu Cheese Dip modifier list.\nMerchants can also add Subcategories to the Modifies These Items section. Select a subcategory, and tap the Arrow to move it into the list.\nReview the Modifies These Items list.\nRemove items from the Modifies These Items list by selecting an item and tapping Delete.\nTap the Add button to add a one or several individual items to Modifies these items. See the instructions “Add Modifiers to a Single Item” below.\nTap Save.\n\n\nFrom the Item Details page, tap the Modifiers tab. See: Find Modifier Details\nTap Add New Item.\nSelect one or more items from the list. Scroll or use search to narrow your choices, then tap Close.\nView the added item(s).\nTap Save.\n\n\nThe MOD has now been added to an item. Now determine whether the modifier will appear as a required modifier or as an optional modifier.\nSee: Difference between a required and an optional modifier\n\nIf the mod will be required, see: Add Modifier to a Group.\nIf the mod will be optional, see: View Modifiers at the Register.\nClick here to schedule your software update today!\nMenu Setup & Management\nModifiers\nWhat is a Modifier?Last Updated: February 2, 2023\nLast Updated: February 2, 2023\nView Modifiers at the RegisterLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifier to a GroupLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nCreate a ModifierLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nEnable Duplicate Required ModifiersLast Updated: February 16, 2024\nLast Updated: February 16, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/add-modifiers-to-an-item/"
  },
  {
    "title": "What is a Service Item?",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 10, 2021\nA service item is a non-tangible, service-based product. Services have an element of time, a cost associated with the service, and a staff member who provides the service.\nFollowing are examples of Service Providers and their services:\nSalon and Spa: Salons/Spas may provide haircuts, coloring, highlights, blowouts. They also may include Massage and Esthetician services. Packages may include combinations of services. Each service item has a time frame, a cost, and a stylist who provides the service.\nBicycle Repair Shop: Bicycle repair shops provide repair services such as Tuneup package, Brake overhaul, Flat tire repair. Technicians provide these services in a specified amount of time.\nHome Cleaning Service: Services may include Full-service cleaning, Deep cleaning, Apartment cleaning, Green cleaning, and/or Consultations and Assessments. Services are scheduled on specific days and times with one or more cleaning professionals.\nSee: Add a Service\nClick here to schedule your software update today!\nMenu Setup & Management\nServices\nInventory Setup & Management\nAdd Staff to a Service ItemLast Updated: June 21, 2024\nLast Updated: June 21, 2024\nAdd a ServiceLast Updated: March 12, 2024\nLast Updated: March 12, 2024\nCan I add both items and services to the register?Last Updated: December 20, 2022\nLast Updated: December 20, 2022\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/what-is-a-service-item/"
  },
  {
    "title": "Add Size Options",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 11, 2024\nSize can be assigned to an item within Items Details. Size options are added or removed via custom variables.\nFrom Home, navigate to Settings > Preferences.\nTap Custom Vars.\nSelect Item Size.\nTap Add Line. Then enter sizes and abbreviations in the Description and Abbreviation fields, if desired. Repeat as needed to add additional sizes.Tip! Delete sizes by tapping Delete.\nTip! Delete sizes by tapping Delete.\nTap Save.\nAlso see: Define Custom Variables\nClick here to schedule your software update today!\nMenu Setup & Management\nDefine Custom VariablesLast Updated: June 14, 2023\nLast Updated: June 14, 2023\nCreate Categories and SubcategoriesLast Updated: March 13, 2024\nLast Updated: March 13, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/add-size-options/"
  },
  {
    "title": "Process Bottle Returns",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tNovember 7, 2023\nIn some states, customers who purchase beverages are charged a deposit for the bottle in addition to the retail price of the beverage. Customers return the empty bottle for a refund of the deposit. In Exatouch, the Bottle Calculator custom button automatically calculates bottle deposit refund amounts.\nPerform the following to process a bottle return:\n\nBegin by creating a bottle deposit description and entering refund amount.\nFrom Home, navigate to Settings > Register Preferences.\nVerify the General tab displays.\nFrom the Default DRV drop-down menu, select a bottle return description.\nWhen selecting the Miscellaneous DRV default setting, enter a refund amount (per bottle) in the Default Bottle Redeem field.\nWhen selecting a custom bottle deposit type:\nTap the magnifying glass icon.\nSelect a description from the list of available bottle deposit types and tap OK.\nThe Price from the custom bottle deposit list automatically populates in the Default Bottle Redeem field.\nTap Save.\n\n\nCreating a Bottle Calculator custom button allows merchants to quickly ring up bottle returns on the Register app.\nFrom the Register Preferences screen, tap the Custom Buttons tab.\nOn the Custom Button screen, tap Buttons.\nSelect an available button from the grid. Available buttons are blank. Buttons can be cleared to make room for another function.\nFrom the Function section, select Bottle Calculator. Scroll or enter keywords in the Search field.\nView the assignment of Bottle Calculator to the grid, then tap Save.\nOn the Register Preferences screen, tap Save again.\n\nUse the Bottle Calculator custom button you created to ring up bottle returns quickly and easily.\nNavigate to the Register.\nTap the Bottle Calculator custom button.\nWhen the Bottle Calculator displays, perform one of the following.\nVerify the desired deposit displays and proceed to Step 4.\nTap the circled X to replace the pre-populated deposit with the default Miscellaneous DRV setting, or select a new deposit by tapping the magnifying glass icon.\nEnter the the number of bottles in the Qty of bottles returned field or tap the plus (+) or minus (–) icons to calculate the bottle deposit refund value.\nTap Add to Order.\nThe Bottle Return value displays as a negative number in the order window and is reflected in the Total. Bottle Return values can be applied as credits toward a purchase or redeemed as a refund.\n\n\nGenerate a Bottle Return Details report to view a history of bottle return transactions.\nFrom Home, navigate to Reports > Sales.\nOn the Sales Report screen, tap the bottle Return Details button.\nTip! Sometimes, the Sales Report screen may display in Advanced Report mode. If that happens, tap the Simple Report button to return to Simple Report mode.\nView the Bottle Return Details report./li>\n\nSee: Process Bottle Deposits\n\nClick here to schedule your software update today!\nInventory Setup & Management\nUsing the Register App – Advanced\nProcess Bottle DepositsLast Updated: November 3, 2023\nLast Updated: November 3, 2023\nSet Up Quick PayoutsLast Updated: December 16, 2022\nLast Updated: December 16, 2022\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/process-bottle-returns/"
  },
  {
    "title": "Define Custom Variables",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJune 14, 2023\nCustom variables allow you to edit multiple data fields throughout Exatouch. Details such as staff type, floor plan components, payout types, and transaction reasons can be defined as custom variables. Item details such as size, color, and style are defined for reporting purposes.\n\nCustom variables are defined under Settings > Preferences. Each custom variable type has a unique set of requirements associated with it. The process of defining custom variables varies by type; some variables require information such as “unit” to be assigned.\nThis is an example of how to define variables for the Item Color group:\nFrom Home, navigate to Settings > Preferences.\nTap the Custom Vars (custom variables) tab.\nIn the Type section, select Item Color, then tap Add Line to add colors.\nEnter a new color.\nDelete colors by tapping Delete next to an entry.\nTap Save.\n\nTip! Check your work! Navigate to the Inventory tab on the Item Details page to view choices in the Color drop-down menu.\n\n\nNote: Custom variables can work in conjunction with custom buttons by defining functions used to create custom buttons. See: Difference between Custom Buttons and Custom Variables\nSelect a custom variable type to learn what custom variables can do for you:\nMerchants can create user-defined fields to track items on a granular level. Under Items Details, there are three user-defined fields. Labels for these fields are assigned via custom variables. Once labels are defined, each label (maximum of 3) displays as a custom report in Sales Reports and/or Advanced Sales Reports. Additional steps are needed in order for user-defined reporting to be functional.\nExample: In reviewing their menu offerings, a Mexican restaurant wants to determine which appetizers, entrees, and desserts are the most popular. User-defined fields can be Appetizers, Entrees, and Desserts.\nImpact: Item Details.  Look for the user-defined field drop-downs.  In order for reporting to be fully functional, drop-down content must be defined, and values need to be chosen.\nReports: Navigate to Reports > Sales, and find the names of reports you defined (maximum 3.)\n\n\nStaff type describes an employee’s role. Create different staff roles to display on an employee profile via Custom Variables. Staff type is not related to access permissions in Exatouch.\nExample: Cashier, Cook, Dishwasher, Manager\nImpact: Staff Details. Look for the “Staff type” field on an employee record.\nReports: N/A\nSee: Create Staff Types and  Difference between Staff Type and User Type\n\n\nFloor plans can be broken down into zones for organized management. Labels for “Floor Plan Zones” are defined via custom variables.\nExample: Main Dining, Bar, Patio\nImpact: Floor Plan Zone labels appear immediately after they are defined via custom variables.\nReports: N/A\n\n\n\nItem size, color, and style are Item-level information used for reporting purposes and/or with Matrix Inventory.\n\nSee: Add Size Options and Add Color Options\n\nExample: A shoe store describes their shoes using Item colors: beige, black, blue; Item size: women’s 5, women’s 6 … women’s 11; Item style: narrow, medium, wide.\nImpact: Item Details, in the Size, Color and Style drop-downs.\nReports: Size, Color, and Style are included in the Sales Reports: Sales by Size, Sales by Color, Sales by Style, and Sales by Matrix. Items List has a “size” column, and “Advanced item search” can filter by size, color, and style.\n\nTip! Size, Color, and Style variables can also be updated on the Items Details page by tapping the “GEAR” icon next to each field.\n\nRevenue Center and Revenue Class are item-level information used for detailed reporting purposes. Data from Revenue Center and Revenue Class fields are designed to display on Business Overview and Snapshot reports. While Revenue center and Revenue class are separate criteria, they can be used together.\nExample 1: Retail store uses Revenue Center to track overall liquor sales. Revenue Center: Liquor\nExample 2: Retail store uses Revenue Center and Revenue Class together to track specific liquor sales. Revenue Center: Liquor; Revenue Class: Brandy, Rum, Vodka\nImpact: Directly impacts Items Details. See Revenue Center and Revenue Class drop-downs. To fully benefit from Revenue center and class labels, labels need to be applied within Items Details.Tip! Revenue Center and Revenue Class can be edited directly by selecting the gear icon next to the field.\nTip! Revenue Center and Revenue Class can be edited directly by selecting the gear icon next to the field.\nReports: “Business Overview Report” and “Snapshot Reports”\n\n\nItem manufacturer data is used for reporting purposes which are unrelated to vendors or purchase orders.\nExample 1: Retailers that deal in auto parts often use manufacturer part numbers and create manufacturer variables which correspond to part numbers.\nExample 2: Firestone, Sumitomo, Goodyear.\nImpact: Item Details. Look for the Manufacturer and Manufacturer Part # drop-down menus.Tip! Item manufacturer can be edited directly from Item Details by selecting the gear icon next to the field.\nTip! Item manufacturer can be edited directly from Item Details by selecting the gear icon next to the field.\nReports: Manufacturer details are displayed in Manufacturer Report and in Advanced Reports, located in Sales Reports.\n\n\nModifier Pages expand modifier offerings at the register. Modifier pages are often associated with ratios. Ratios must be defined as whole numbers. Pizzerias often use modifier pages to describe pizza toppings.\nExample: A pizzeria defines the following modifier pages:\n\nWhole Topping – Ratio 100.00\n1/2 Topping – Ratio 50.00\n1/4 Topping – Ratio 25.00\nWhole Topping – Ratio 100.00\n1/2 Topping – Ratio 50.00\n1/4 Topping – Ratio 25.00\n\nImpact: The Register, on orders with MODS. View Modifier Pages when the MOD window pops-up at the register. While Modifers Page labels appear immediately at the register, further steps are needed for full functionality.\nReports: N/A\n\nSee: How to Use Modifier Pages and Organize Modifier Pages\n\n\n\nRestaurants can assign custom labels to their courses.\nExample: Beverages, Appetizers, Entree, Dessert\nImpact: Coursing at the register. Select “Course Seats” to add course entries, and view the course labels.\nReports: N/A\n\nNote: Course labels are used in conjunction with course firing. For full functionality, enable printer preferences for course firing.  See: Setup Course Firing Printer Preferences and Rename Restaurant Courses\n\nInstructions provide additional detail on applying MODS to an order. This is especially helpful to restaurants who communicate specific instructions to kitchen staff before an order is prepared. Up to 8 custom Instruction variables can be defined.\nExample: An Italian restaurant applies these instructions to clarify their modifiers: Extra $, Add $. Associated modifiers include: Olives, Onions, Peppers. A customer orders a “House Salad” with “Extra” + “Olives.” “Extra” is an instruction on how to apply “Olives.”\nImpact: The Register, when a MOD is added to the order. Instructions appear as GREEN buttons in the MOD section. Note the total price difference when adding Optional Modifiers, such as Extra Bacon.\nReports: N/A\n\nTip! Don’t forget to double-tap “All Modifiers” to clear the instruction button after selections are complete.\nSee: Create Instruction Modifiers\n\nTrack pre-defined reasons for voids and refunds in reports. These fields are optional but can be set to “required” in Settings.\nExample: Incorrect Price, Damaged Item\nImpact: The Register. Refund is located on the Global Menu by default. Orders can be voided from the Open orders window. When a refund is processed, the user is prompted to enter a refund reason. When a void is processed, the user is prompted to enter a reason for the void.\nReports: “Refund/Void Report,” located under Reports > Sales.\n\n\nTrack instances of company pay-ins for reporting purposes.\nExample 1: A convenience store returns unsold magazines to the vendor for reimbursement. “Vendor Reimbursement” is considered a “Company Pay In.”\nExample 2: Change (i.e. nickels, dimes, quarters) from a company payout can be considered a company pay in – “Payout Change”\nImpact: The Register. Company pay ins are processed on the Order Details tab at the Register. When pay ins are processed, merchants are prompted to select a reason for the pay in.\nReports: “Pay in/out Report,” located under Reports > Sales.\n\n\nTrack reasons for company payouts on reports.\nExamples: Inventory, Supplies, Expenses\nImpact: The Register. Company payouts are processed on the Order Details tab at the Register. When payouts are processed, merchants are prompted to select a reason for the payout.\nReports: “Pay in/out Report,” located under Reports > Sales.\n\n\nTrack reasons for customer payouts on reports.\nExample: Lottery, Events, Promotions\nImpact: The Register. When customer payouts are processed, merchants are prompted to select a payout reason.\nReports: “Pay in/out Report,” located in Sales Reports\n\nSee: Process Customer Payouts and Setup Quick Payout\n\n\n\nThis variable helps merchants sell “by-fraction” items while deducting the weight of the container (aka tare weight). Container weight is an Item-level variable, and each container type is assigned a weight and a unit.\nExample: An ice cream store sells different size ice cream cups by weight. They don’t want to include the container weight in their sales, so “Container Weight” variables are created for different types of containers, each corresponding to weight and unit: SM/0.1000/lb, MED/0.2000/lb, LG/0.3000/lb.\nImpact: The Register. When a “sold by fraction” item is rung up, container weight options pop-up for selection.Tip! A “New Container” variable can be created directly from the Select Container pop-up.\nTip! A “New Container” variable can be created directly from the Select Container pop-up.\nReports: N/A\n\nNote: “Sold-by-fraction” weight and “Container Weight” need to be the same for proper functionality. If these weights are different, container weight will not display at the Register.\n\nAllows restaurants to display custom order types which are displayed on kitchen receipts, informing kitchen staff how to prepare an order. Custom order type can be set to default at the time of setup.\nEach Custom Order variable is assigned an order “Type.” Each order type has a set of characteristics:\nDine In: does not require customer info, no delivery address\nTake Out: requires customer info, no delivery address\nPick Up: requires customer info\nDelivery: requires customer info and a valid delivery address; Delivery orders can be used with the Delivery Manager\nExample: Restaurants with call-in orders create these custom order types: Pick Up, Delivery, Delivery Service.\nImpact: Custom Buttons and the Register. After Custom Order Types are defined within custom variables, order types become available to assign as custom buttons. Once assigned as custom buttons, order types display at the register.\nReports: “Business Overview” and “Snapshot Reports.” See “Sales by Order type” section in each report.\n\nNote: “Sold-by-fraction” weight and “Container Weight” need to be the same for proper functionality. If these weights are different, container weight will not display at the Register.\n\nSpecial instructions are used with MODS at the register. This is helpful for restaurants wishing to provide additional information for the kitchen staff. Up to 14 special instruction variables can be defined.\n\nTip! Special Instructions do not change the application of a MOD at the Register; they simply convey a message to kitchen staff\n\nExample: Gluten Allergy, Peanut Allergy, Vegan\nImpact: The Register, when MODS are added. Special instructions appear on BLUE buttons in the Modifiers section.\nReports: N/A\n\nNote: “Sold-by-fraction” weight and “Container Weight” need to be the same for proper functionality. If these weights are different, container weight will not display at the register.\nSee: Create Special Instruction Modifiers\nClick here to schedule your software update today!\nInventory Setup & Management\nDifference Between Custom Buttons and Custom VariablesLast Updated: May 6, 2024\nLast Updated: May 6, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/define-custom-variables/"
  },
  {
    "title": "Advantages of Setting Up Multiple SKUs For an Item",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 10, 2021\nSetting up multiple SKUs for an item allows you to track items more efficiently. Use sales trends to make informed purchasing decisions.\nExample:  You sell several special editions of a liquor which have the same volume, contents, and SKU number assigned by the manufacturer.\nUse Exatouch to assign an Alternate SKU to items bearing the same Manufacturer SKU number, then use these Alternate SKUs to track sales for each edition. Reference the sales information broken down by special edition to make an informed decision about repurchasing special edition items.\n\nClick here to schedule your software update today!\nInventory Setup & Management\nAdding & Managing Items\nGenerate SKU Numbers and Assign Alternate SKU NumbersLast Updated: March 10, 2021\nLast Updated: March 10, 2021\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/advantages-of-setting-up-multiple-skus-for-an-item/"
  },
  {
    "title": "Generate SKU Numbers and Assign Alternate SKU Numbers",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 10, 2021\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nThe Stock Keeping Unit (SKU) is a multi-digit number assigned to inventory and menu items. Exatouch supports EAN-13, EAN-8, UPC-A, and UPC-E compliant barcodes.\nUse Exatouch to generate a SKU for any item, or assign an Alternate SKU to items to sell multiple versions of an item.\n\n\nFind and open an existing item to edit. Alternatively, start a new item record.\nTap to select the Details tab.\nTap the SKU button next to the SKU field to generate a UPC-A (12 digit) or UPC-E (8 digit) number.\nTap the SKU button again to switch between a generated UPC-A or UPC-E number.\nTap Save to save your changes.\n\n\n\nExample: Your beverage vendor delivers several cases of a special edition soda that differs from an existing item only by barcode and packaging images.\n\nFind and open an existing item to edit. Alternatively, start a new item record.\nTap to select the Inventory Options tab.\nTap an empty SKU field in the Alternate SKU work area and enter or scan the desired SKU or barcode.\nTap the Description field to enter the description for the added SKU, if needed.\nTap Save after completing all changes on the Inventory Options tab.\nTap a SKU number or Description to change it, or Delete to remove an Alternate SKU.\n\n\nInventory Setup & Management\nAdding & Managing Items\nAdd an ItemLast Updated: August 29, 2024\nLast Updated: August 29, 2024\nAdvantages of Setting Up Multiple SKUs For an ItemLast Updated: March 10, 2021\nLast Updated: March 10, 2021\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/generate-sku-numbers-locally/"
  },
  {
    "title": "Duplicate Items and Modifiers",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJanuary 4, 2024\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nSave time and effort adding new items by duplicating and editing an existing item or modifier.\nDuplicating existing items allows merchants to quickly build their menu without having to build individual items and items with modifiers from scratch.\nFor example, a merchant creating a new Angus Burger in Exatouch wants it to retain the same modifiers as other burgers on the menu. This can be accomplished by using the Duplicate button under Item Details.\n\nFrom Home, navigate to Items > Item List.\nSelect an item to duplicate from the Item List screen.\nOn the Item Details screen, tap Duplicate.\nPerform the following:\nSKU: Enter or generate a new SKU.\nItem Name: Enter a name (e.g. Angus Burger) for the duplicated item.\nPrice:: Enter a price for the duplicated item, if desired.\nDescription (Optional): Enter any other description information for the duplicated item.\nTap Save.\nCheck Your Work: Navigate to the Register, select the recently duplicated item, and verify modifiers also display for that item.\nSKU and Alternate SKU fields display as blank when duplicating an item.\nOther fields possibly requiring adjustment include the following:\nVendor Name and Part Number fields\nStock Locations and Inventory fields\nPromo, Sale, and Discount settings\n\n\nDuplicating modifiers also helps merchants save time when creating a menu or expanding a menu in Exatouch. For example, a merchant can add Cajun Fries as an optional side for all entrees that already offer Onion Rings as a side.\nFrom the Item List screen, select a modifier to duplicate.\nOn the Item Details screen, tap Duplicate.\nPerform the following:\nEnter a new SKU number.\nIn the Item Name field, enter a name for the new modifier (e.g., Cajun Fries).\nEnter a new price, if necessary.\nTap Save.\nCheck Your Work: Navigate to the Register app and enter an item. The item’s newly duplicated modifier displays in the Sides column.\n\nTip! Merchants can also limit the number of modifiers allowed for a root item by adjusting the Modifier Limit setting. See: Enable Modifier Limits.\n\n\nInventory Setup & Management\nAdding & Managing Items\nAdd an ItemLast Updated: August 29, 2024\nLast Updated: August 29, 2024\nDuplicate Items and ModifiersLast Updated: January 4, 2024\nLast Updated: January 4, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/duplicate-an-item/"
  },
  {
    "title": "Low Level Quantities in the Register",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMay 7, 2024\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nUse Exatouch to manage and monitor your inventory. Use the Inventory work area of Item Details to view and manage your inventory items, set quantity defaults and alerts, as well as manage details about the items you carry in stock.\nSet a low level quantity threshold, and optionally trigger an alert when inventory dips below that level. This alert pops up in the Register app as a visual reminder to reorder this item.\nNote: This article explains how to define low level quantity alerts in the Register app. For low level quantity alerts for Purchase Orders, see: Low Level Quantities for Purchase Orders.\nFrom Home, navigate to Items > Item List.\nSelect an item to open the item’s Item Details work area.\nTap the Inventory tab to open the Inventory work area.\nIn the Stock Type section, tap Inventory Item to enable inventory fields.\nOn the item’s Item Details screen, enter a low inventory threshold in the Low Level Qty field for the item.\nIf inventory falls below this threshold, it is returned in reports and searches based on low level and reorder needs.\nIf Alert is enabled, users are notified in the Register app when inventory drops below the low level quantity threshold on an item in an order.\nOptionally, define Reorder Qty, Minimum Order Qty, and Case Qty.\nTap Save.\n\nNote: To enable low level quantity alerts in the Register app, the item must first be associated with a vendor. See: Set Default Vendor for an Item.\n\nOn the item’s Item Details screen, enable the Alert (Inventory Items only) slider to alert users in the Register app when inventory drops below the Low Level Qty threshold.\nTap Save.\nCreate an order in the Register app. If an item’s quantity falls below the Low Level Qty value, an alert displays in the Register.\n\nSee: Create a Purchase Order and Modify Inventory Levels\n\nPurchase Order Management\nInventory Setup & Management\nCreate a Purchase OrderLast Updated: May 17, 2024\nLast Updated: May 17, 2024\nModify Inventory LevelsLast Updated: June 8, 2023\nLast Updated: June 8, 2023\nDynamic ReorderingLast Updated: November 23, 2022\nLast Updated: November 23, 2022\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-low-level-quantity-for-an-item/"
  },
  {
    "title": "Release Notes Archive (2021)",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tJune 4, 2024\nThis article includes an archive of Release Notes from 2021. Click the Table of Contents link below to display individual topics in alphabetical order. Each includes hyperlinked Release Notes version/date in parentheses. To read more about any topic, click on the hyperlink or scroll down to the applicable Release Notes version, then click the appropriate topic header.\n\nApply to Tag Along Added as New Setting (see  Release Notes 8.337)\nBottle Calculation in the Register App (see  Release Notes 8.325)\nBottle Calculator Options (see  Release Notes 8.338)\nCustomization and Display Options for the Customer Facing Display (CFD) (see  Release Notes 8.319)\nDynamic Reordering (see  Release Notes 8.324)\nExclude an Item From Discounts and Promotions (see  Release Notes 8.319)\nExpanded Checkout Fee Tax Options (see  Release Notes 8.328)\nExpanded Customer Facing Display (CFD) Settings (see  Release Notes 8.319)\nExpanded Item Filtering Options in Purchasing (see  Release Notes 8.335)\nExpanded Reporting for Checkout Fees (see  Release Notes 8.338)\nExpanded: Age Verification Options and Override Restrictions (see  Release Notes 8.332)\nExpanded: SKU Validation Options (see  Release Notes 8.339)\nExtended Scan Data Program (see  Release Notes 8.332)\nForce User Clock Out (see  Release Notes 8.334)\nFraud Control Update: Age Verification Override (see  Release Notes 8.339)\nFraud Control Update: Tip Security Limits (see  Release Notes 8.324)\nGenerate Check Digits for 11-Digit SKUs on Import (see  Release Notes 8.338)\nImport Expanded SKU Information (see  Release Notes 8.334)\nImport Items With Multiple Alternate SKUs (see  Release Notes 8.319)\nIn-Counter Scale Support (see  Release Notes 8.334)\nJUUL Certification Support (see  Release Notes 8.337)\nLast 7- and Last 14-Day Ranges for Reports(see  Release Notes 8.334)\nLimit Quantity Sales Using Order Limit Quantity (see  Release Notes 8.328)\nModify Pricing on Markup Priced Items (see  Release Notes 8.334)\nMore Print Options for Sticky Labels! (see  Release Notes 8.325)\nNew Settings for Customer Facing Displays (see  Release Notes 8.339)\nModify All Items Expanded(see  Release Notes 8.325)\nOpen Batch Settlement Options and Alerts for Offline Transactions (see  Release Notes 8.319)\nPayroll Report (see  Release Notes 8.334)\nPickup and Delivery Time on Receipts (see  Release Notes 8.319)\nPrint Modifiers to Specific Printers (see  Release Notes 8.319)\nPrint Tip Slip (see  Release Notes 8.338)\nPurchase Orders: Access and Update Item Details Records (see  Release Notes 8.324)\nPromos & Discounts Report (see  Release Notes 8.334)\nReporting Enhancements – Discounts and Promotions (see  Release Notes 8.334)\nScan to Add New Items (see  Release Notes 8.335)\nSet Auto Batch Times in Multi-Terminal Environments (see  Release Notes 8.339)\nScheduling Reports Reminder (see  Release Notes 8.334)\nTab Auth Receipt Options (see  Release Notes 8.332)\nTender Total Options for Receipts (see  Release Notes 8.319)\nTip Security: Optional (see  Release Notes 8.338)\nUpdated Pay In/Out Report (see  Release Notes 8.334)\nUpdated Tip Adjustment in Delivery Manager (see  Release Notes 8.324)\n\nIn this release, we’ve improved auto batch timing, increased security for items sold using Age Verification, expanded SKU validation, and expanded the flexibility options for your customer facing displays.\nWarning: Exatouch versions before Release 8.367 may not fully comply with recently implemented card brand requirements. Electronic Payments, Inc. strongly recommends you update to the latest version of Exatouch to meet these requirements.\nWe’ve added a new setting: SKU Validation, enabled by default. With SKU Validation enabled, Exatouch ensures that SKU numbers are entered correctly into appropriate Item Details fields or imported as part of an Inventory Import.\nEnabled by default, SKU Validation allows Exatouch to validate SKUs as:\nUPCE (8 characters)\nUPCA (12 characters)\nEAN13 (13 characters)\nTo disable this setting, navigate from Home to Preferences > Inventory tab.\n\n\nUpdate the Age Verification Override settings by navigating from Home to Account > Settings > Fraud Control. Accessible only by Support, work with the Support team to define the two age levels for eligible items, and to allow or deny manual override of age requirements.\n\nNote: Only the Account Owner can work with Support to make changes to Age Verification and Override settings in Fraud Control.\nTip! Not sure what version of Exatouch you’re running? Click here to learn how to find out.\nReady to Upgrade?: Contact Technical Support at 800-966-5520 – Option 3.\n\nCustomer Facing Display settings provide flexibly to give your customers the information they need at purchase time. These settings are enabled by default. Find these settings by navigating from Home to Settings > Preferences > CFD.\n\nDual Pricing — Enable to show both cash and non-cash pricing for every item. Disable to show the non-cash price only.\nDisplay Subtotal — Enable to show a Subtotal line for each order. Disable to hide.\nDisplay Sales Tax — Enable to show the Sales Tax for each order. Disable to hide.\nDisplay Discount — Enable to show a Discount line for each order. Disable to hide.\n\n\nWe’ve enhanced our auto batch settings to allow you to stagger terminal auto batch times. This allows for staggered closings and ensures each terminal has enough communication time to close.\nNote:  This removes the option Allow Server to Batch Close All Terminals.\nAs part of removing the setting Allow Server to Batch Close All Terminals, all Sidekicks inherit the auto batch time set at the server. Users with appropriate access can update the times for each unit as needed by navigating from Home to Settings > Account > Merchant Account tab.\n\n\nBack to Top\nWith this release, we’ve expanded functionality of the Bottle Calculator, expanded Checkout Fee reporting, added a Print Tip Slip option, and made Tip Security optional. Merchants can import 11-digit SKUs with Exatouch providing the appropriate 12th check digit.\nWarning: Exatouch versions 8.367 and earlier may not fully comply with recently implemented card brand requirements. Electronic Payments, Inc. strongly recommends you update to the latest version of Exatouch to meet these requirements.\n\nWe’ve expanded the bottle calculator options to help you ring up orders smoothly when a bottle redemption is involved.\nNavigate from Home to Settings > Register Preferences > General tab. Use the search option to select a Default DRV: item and set the default redemption value for the Default Bottle Redeem: field.\n\nAfter you’ve set a default value, it populates in the bottle calculator. Adjust the number of bottles returned as needed, then tap Add to Order to include the refund credit to an order.\nIf your system includes multiple bottle refunds, clear the default item and search for the appropriate bottle.\n\n\n\n\nWe’ve added a separate line item for refunded checkout fees to the business overview and snapshot sales reports. The Tender Discount & Fees report will break out checkout fees for individual stations, as needed.\n\nWarning: Exatouch versions 8.367 and earlier may not fully comply with recently implemented card brand requirements. Electronic Payments, Inc. strongly recommends you update to the latest version of Exatouch to meet these requirements.\n\nImporting 11-digit SKUs? Exatouch will generate the 12th digit check SKU on import. Add your items to the current inventory import form, add the alpha character C as the 12th digit to 11 digit SKUs, and Exatouch generates the appropriate check digit as needed.\n\n\nThe Print Tip Slip button in the Mod Tips work area will allow users to generate a receipt for customers who’d like to add a tip to their payment. Tap to print a tip slip for your customer, then complete the transaction with tip modifications when ready.\n\n\n\nIn this update, we’ve given you the option to make Tip Security limits optional. Tip Security limits are enabled by default, and set at 200%.\n\nNote: Only the Account Owner can work with Support to change the Tip Security percentage amount from the default, 200%, or to disable Tip Security completely.\nBack to Top\nWith this release, discounts are applied to tagalongs by default, and retail stores can set up their JUUL inventory to meet the Enhanced Access Controls (EAC) established to enforce age restrictions on JUUL products.\n\nIt’s now easier than ever to ensure promotions are applied to your tag along items. With this release, promotions are applied to tag alongs by default. Disable to apply the tag along with no discount.\nTo disable this setting, navigate from Home to Settings > Register Settings > Promos.\n\n\n\n\nExatouch allows you to offer JUUL items in inventory under guidelines specified by JUUL to meet their certification standards. JUUL-specific SKUs are added to limited categories and subcategories, and items sold are restricted to established guidelines and meet legal age requirements.\nAfter upgrading to this release or later, your SKUs in Exatouch are added to the correct categories, subcategories, and are limited by Exatouch when added to an order in the Register app.\nAfter upgrading to this release or later, you can import JUUL SKUs or add new SKUs using Item Details, then enable age check for each. Your SKUs are added to the correct categories, subcategories, and are limited by Exatouch when added to an order in the Register app.\n\nNote: Default age restrictions are set to 18 and 21 and can only be changed by Support. Apply to all required products.\n\nWhen JUUL items are set up to specifications, staffers attempting to add more than the allowed quantity of items to an order will see a warning message. Clear the message, and complete the transaction that includes the allowed quantities.\n\nBack to Top\nIn this release, we’ve added the capability to add new items using your barcode scanners, and included new item filtering options to help you make purchasing decisions using expanded information in one handy work area.\n\nWe’ve expanded the item information visible during purchase order creation, putting more information right where you need it. We’ve expanded the item information visible during purchase order creation, putting more information right where you need it.\n\n\nScanning an item at the register not in inventory? Exatouch now makes it easy to add new items in the Register app. When any user scans an item in the Register app, unknown items will prompt the user to add it to inventory.\nScan unknown item. Exatouch prompts you to add the item to inventory.\nTap Yes to add the item. Exatouch opens a new item work area.\nComplete the required item fields and tap Save to save the new item, then tap the back arrow to return to the Register app.\nScan the item again to add it to your customer’s order.\n\nBack to Top\nIn this release, we’ve added multiple reporting enhancements, including a new Payroll report, expanded reporting for discounts and promotions, updated Pay In/Out reporting. We’ve also added new, easy date range options you can use to generate both immediate and scheduled reports. A friendly reminder pops up when you create new scheduled reports: Keep your Exatouch system powered on to ensure reports go out as scheduled.\nOther new features include an option to force users to clock out, modify item prices if you use markup pricing, and support for a greater range of supported SKUs for import. Finally, we’ve added support for a new in-counter scale.\n\nThe Force Clock Out option ensures staff members are clocked out appropriately at the end of the business day, or at a specific time for individual users. Disabled by default, Admin users can enable this feature by navigating to a specific user’s Staff Details work area.\n\nNote: For this feature to work, on the Preferences screen, the Clock-In Required setting must be enabled and the Clock-Out Validation setting must be disabled. Access these settings by navigating to Settings > Preferences, and then tapping the Security tab.\n\nFrom Home, navigate to Staff > Staff Details work area for a specific staff member.\nSelect Force Clock-Out for this staff member.\n\nLeave the Time: field blank to force this staff member, if clocked in, to automatically clock out at the end of the business day.\nEnter a specific time in the Time: field to force this staff member, if clocked in, to automatically clock out within five minutes of the time specified.\nLeave the Time: field blank to force this staff member, if clocked in, to automatically clock out at the end of the business day.\nEnter a specific time in the Time: field to force this staff member, if clocked in, to automatically clock out within five minutes of the time specified.\nTap Save to save your changes.\nWhen enabled for one or more users, Exatouch checks to see if the user is clocked in, and automatically clocks the user out within five minutes of the close of business or their individually defined time, whichever is applicable.\n\n\nWe’ve expanded the range of SKU information you can import into your Exatouch POS system to make adding new inventory a simple task. SKU lengths between 1 and 16 characters long can be imported, scanned, and used in your day to day inventory management and sales tasks.\n\nNote: Exatouch continues to support label printing for properly formatted 8, 12, and 13 digit SKUs.\n\n\n\nThe Exatouch POS system supports the Datalogic Magellan 9400i in-counter scale. After installation and Exatouch setup, staff members can weigh and ring up both standard items and items sold by weight to an order quickly and easily in a number of ways.\nUse the scale’s integrated scanner to scan any item for an order in the Register app.\nWeigh an item, enter and accept a unit price to add it to the order.\nScan an item using the scale, weigh the item, then accept the weight to add it to the order.\nScan an item using a USB scanner, weigh the item, then accept the weight to add it to the order.\n\nNote: Contact Technical Support for assistance in setting up scale communications with your Exatouch environment.\n\nYou can quickly and easily retrieve Exatouch reports by using custom date range options such as Last 7 Days and Last 14 Days. No need to cycle through the calendar options to select the range: just tap an option from the Range: drop down selector and preview, run, or schedule and send your report. Some reports may require you to provide other details to return specific information.\n\nNote: Leave your Exatouch Systems powered up and logged in during business and non-business hours to generate and deliver scheduled reports.\n\n\n\nUsing markup pricing and need to change an item or service price? With this release, you can now manually modify an item or service price. The markup (calculated in dollars or percentage amounts as needed) recalculates automatically.\n\n\nUse the Payroll Report to generate information to share with your payroll department in a quick and easy format. The payroll report includes information across the date and time range you select. Each staff member who worked in that time period is shown, along with their staff type, net hours worked (hours worked minus clocked out breaks), totals and tips. Like most of our full reports, generate as needed, or schedule and send on a recurring basis.\nNote: Leave your Exatouch Systems powered up and logged in during business and non-business hours to generate and deliver scheduled reports.\n\n\n\nGet a better look at your discounts and promotions for all orders on the Promos & Discounts report, which provides a detailed report of items sold below your established retail cost.\nSingle line item promotions\nEntire order promotions\nItem level promotions\nCategory level promotions\nSubcategory level promotions\nMix & Match promotions\nService promotions\nOpen ended discounts\nTime-based promotions, such as “happy hour” specials\n\n\nNote: Leave your Exatouch Systems powered up and logged in during business and non-business hours to generate and deliver scheduled reports.\n\nWe’ve expanded the visibility of discounts for three sales reports: Business Overview, Business Snapshot, and Sales by Date.\nThe Business Overview report changes include addition of a Discount by Category section, and combination of the Promotions and Discounts sections into one Promotions and Discounts section.\nThe Business Snapshot report includes a new Discount by Category section, and combination of the Promotions and Discounts sections into one Promotions and Discounts section.\nThe Sales by Date report includes a Discount column specifying items sold with a discount. The discounts are made more visible displayed as a negative number -$1.55 rather than as a number in parenthesis ($1.55).  Discounts now total at the bottom of this report.\n\nNote: Leave your Exatouch Systems powered up and logged in during business and non-business hours to generate and deliver scheduled reports.\n\n\n\nExatouch makes it easy to set up and run custom and standard reports in advance. We’ve added a friendly reminder to this process reminding you to leave your Exatouch environment powered up and logged in for reports to be sent as scheduled.\nSelect a report to send Send as Excel, PDF, or Word format.\nEnter Recipients in the To: and Cc: field, separated by commas.\nEnter Schedule reports information, such as Range, Format, and Times To Send.\nSelect a Choose Report frequency, such as Daily On, Daily Every Day, or other option.\nIf applicable, enable appropriate days of the week, 1st or 15th of the month, as needed.\nTap Save to schedule your report.\nTap Close to close the success message.\n\n\n\nWe’ve expanded the Pay In/Out report to group and specify payments in and out on a per-station basis for environments running one or more Exatouch stations.\n\nNote: Leave your Exatouch Systems powered up and logged in during business and non-business hours to generate and deliver scheduled reports.\n\n\nBack to Top\nIn this release, we’ve added a new printing option for Tab Auth transactions, expanded our age verification options, and extended our Scan Data integration.\n\nAge Verification setup has moved to Fraud Control in Account > Settings. Accessible only by Support, work with the Support team to define the two age levels for eligible items, and to allow or deny manual override of age requirements.\nBy default, the Override button is enabled and available to users with access to the feature. If disabled, no users can manually override age verification. The default Legal Age settings are now set to 18 and 21; any existing ages you have defined do not change with this upgrade.\n\nNote: Only the Account Owner can work with Support to make changes to Age Verification and Override settings in Fraud Control.\nTip! Not sure what version of Exatouch you’re running? Click here to learn how to find out.\nReady to Upgrade?: Contact Technical Support at 800-966-5520 – Option 3.\n\n\n\nWe’ve extended our Scan Data integration to allow merchants to track sales, loyalty benefits, and rebate programs for both RJ Reynolds and Altria products as needed. Speak with your local products representatives to set up appropriate manufacturer accounts.\n\nTip! Not sure what version of Exatouch you’re running? Click here to learn how to find out.\nReady to Upgrade?: Contact Technical Support at 800-966-5520 – Option 3.\n\n\n\nPrint option settings for Tab Auth orders enable you to save time and paperwork clutter by limiting receipt printing. To enable Include Tab Auth, navigate from Home to Settings > Print Settings > Receipt Options.\nEnable Print Order on Save and Include Tab Auth to print a receipt every time you save or send a Tab Auth order.\nDisable Include Tab Auth to suppress receipt printing every time you save or send a Tab Auth order.\nTo print a receipt when Include Tab Auth is disabled, open the order in the Register App and tap Print Order to print the receipts.\n\nTip! Not sure what version of Exatouch you’re running? Click here to learn how to find out.\nReady to Upgrade?: Contact Technical Support at 800-966-5520 – Option 3.\n\n\nBack to Top\n\nIn this release, we’ve added features that allow you to set quantity limits on customer orders, and expanded tax options related to fees to assist you in meet your local taxation requirements.\nWarning: Exatouch versions 8.367 and earlier may not fully comply with recently implemented card brand requirements. Electronic Payments, Inc. strongly recommends you update to the latest version of Exatouch to meet these requirements.\n\nWe’ve expanded the flexibility of tax options for checkout fees. As part of this release, if you don’t have Apply Fee To Taxes or Fee is Taxable enabled, Apply Fee To Taxes is enabled by default.\nIf Apply Fee to Taxes or Fee is Taxable are enabled before you update to this release, your settings remain unchanged.\nThese checkout fee tax options allow you to define what items are affected by a checkout fee in alignment with your local tax jurisdiction’s guidelines.\n\nNote: \n\nTo calculate taxes on any Checkout Fees, you must also enable Checkout Fees in the appropriate tax groups.\nFrom Home, navigate to Settings > Tax Group Settings > and enable Checkout Fee in the appropriate Tax Groups.\nIf your tax jurisdiction restricts some items from application of a checkout fee, apply a tax group without checkout fees to those items.\n\nTo calculate taxes on any Checkout Fees, you must also enable Checkout Fees in the appropriate tax groups.\nFrom Home, navigate to Settings > Tax Group Settings > and enable Checkout Fee in the appropriate Tax Groups.\nIf your tax jurisdiction restricts some items from application of a checkout fee, apply a tax group without checkout fees to those items.\n\n\nTo limit quantity sales, use Order Limit Qty in the Item Details > Inventory work area. Enter an amount in this field to restrict customer purchases to that quantity on individual items.\nIf you have categories or subcategories of items you need to limit, set limits at the category or subcategory level.\nAfter you’ve set an Order Limit Qty for an item, category, or subcategory, a customer attempting to purchase more than the limit is restricted to the quantities you’ve defined.\nA warning is shown in the Register app; staffers simply tap Close to dismiss the message.\nThe quantity for the item or items is reduced to meet the Order Limit Qty.\nStaffers can then complete the transaction.\n\nAs items are rung up, quantity is checked against the defined Order Limit Qty at the item level, subcategory level, then category level. If any or all of these quantities are defined, the purchase is limited by the defined amount in the Register app.\nWhen an item is added to an order, the quantity is checked against the Order Limit Qty in this order:\nAt the item level:\n\nIf the subcategory or category Order Limit Qty is not defined, the item’s Order Limit Qty is used.\nIf the subcategory or category Order Limit Qty is defined, they override the item’s Order Limit Qty.\nIf the subcategory or category Order Limit Qty is not defined, the item’s Order Limit Qty is used.\nIf the subcategory or category Order Limit Qty is defined, they override the item’s Order Limit Qty.\nAt the subcategory level:\n\nIf the subcategory Order Limit Qty is not defined, the item’s Order Limit Qty is used.\nIf the subcategory Order Limit is defined, it overrides the item’s Order Limit Qty.\nIf the subcategory Order Limit Qty is not defined, the item’s Order Limit Qty is used.\nIf the subcategory Order Limit is defined, it overrides the item’s Order Limit Qty.\nAt the category level:\n\nIf the category Order Limit Qty is not defined, and the subcategory limit is not defined, the item’s Order Limit Qty is used.\nIf the category Order Limit Qty is not defined, and the subcategory limit is defined, it overrides the item’s Order Limit Qty.\nIf the category Order limit is defined, it overrides the subcategory limit and the item’s Order Limit Qty.\nIf the category Order Limit Qty is not defined, and the subcategory limit is not defined, the item’s Order Limit Qty is used.\nIf the category Order Limit Qty is not defined, and the subcategory limit is defined, it overrides the item’s Order Limit Qty.\nIf the category Order limit is defined, it overrides the subcategory limit and the item’s Order Limit Qty.\n\nExample: \n\nA tobacco shop must limit the purchase of electronic cigarettes to 1 per sale, and refill cartridges to 3 per sale.\n\nDefine the Order Limit Qty for the category electronic cigarettes to 1, and the Order Limit Qty for the category refill cartridges to 3.\n\nCustomers can buy up to 1 item from the category electronic cigarettes, and up to 3 items from the category refill cartridges.\n\nA tobacco shop must limit the purchase of electronic cigarettes to 1 per sale, and refill cartridges to 3 per sale.\n\nDefine the Order Limit Qty for the category electronic cigarettes to 1, and the Order Limit Qty for the category refill cartridges to 3.\n\nCustomers can buy up to 1 item from the category electronic cigarettes, and up to 3 items from the category refill cartridges.\nDefine the Order Limit Qty for the category electronic cigarettes to 1, and the Order Limit Qty for the category refill cartridges to 3.\n\nCustomers can buy up to 1 item from the category electronic cigarettes, and up to 3 items from the category refill cartridges.\nCustomers can buy up to 1 item from the category electronic cigarettes, and up to 3 items from the category refill cartridges.\nFrom Home, navigate to Item Details > Inventory work area. Enter an amount in the Order Limit Qty field to restrict customer purchases to that quantity.\n\nExample: \n\nA coffee shop wants to limit the purchase of their unlimited refills anniversary mug to 1 per sale.\n\nDefine the Order Limit Qty for that item as 1.\n\nCustomers can buy 1 mug per sale.\n\nA coffee shop wants to limit the purchase of their unlimited refills anniversary mug to 1 per sale.\n\nDefine the Order Limit Qty for that item as 1.\n\nCustomers can buy 1 mug per sale.\nDefine the Order Limit Qty for that item as 1.\n\nCustomers can buy 1 mug per sale.\nCustomers can buy 1 mug per sale.\nFrom Home, navigate to Items > Categories > and tap to select a category. Scroll through the categories to find a specific category.\nEnter an amount in the Order Limit Qty field to restrict customer purchases to that quantity.\nWhen you’ve completed your changes, tap Save. This Order Limit Qty is now active for all items in this category.\n\nExample: \n\nA specialty bakery wants to limit cupcake sales to 6 per customer.\n\nDefine the Order Limit Qty for the category cupcakes as 6.\n\nCustomers can buy up to 6 items from the category cupcakes.\n\nA specialty bakery wants to limit cupcake sales to 6 per customer.\n\nDefine the Order Limit Qty for the category cupcakes as 6.\n\nCustomers can buy up to 6 items from the category cupcakes.\nDefine the Order Limit Qty for the category cupcakes as 6.\n\nCustomers can buy up to 6 items from the category cupcakes.\nCustomers can buy up to 6 items from the category cupcakes.\nFrom Home, navigate to Items > Categories > and tap to select a category, then a subcategory. Scroll through the categories to find a specific category and subcategory.\nEnter an amount in the Order Limit Qty field to restrict customer purchases to that quantity.\nWhen you’ve completed your changes, tap Save. This Order Limit Qty is now active for all items in this subcategory.\n\nExample: \n\nA retail store needs to limit the purchase of hand sanitizer products to 2 per sale.\n\nDefine the Order Limit Qty for the subcategory hand sanitizers as 2.\n\nCustomers can buy up to 2 items from the subcategory hand sanitizers.\n\nA retail store needs to limit the purchase of hand sanitizer products to 2 per sale.\n\nDefine the Order Limit Qty for the subcategory hand sanitizers as 2.\n\nCustomers can buy up to 2 items from the subcategory hand sanitizers.\nDefine the Order Limit Qty for the subcategory hand sanitizers as 2.\n\nCustomers can buy up to 2 items from the subcategory hand sanitizers.\nCustomers can buy up to 2 items from the subcategory hand sanitizers.\n\n\nBack to Top\nIn this release, we’ve expanded support for sticky label printers, allowing you to print to two additional receipt widths, increased the number of fields you can change when you modify items in bulk, and added a bottle calculator to make totaling up redemption values easier.\n\nWe’ve added a calculator function to the Register App you can use to total up redemption values as needed. Add the new custom button, Bottle Calculator, to the Register app, then tap any time to bring this new calculator. Use the green plus (+) and red minus (–) buttons to adjust the number of bottles returned, and adjust the redemption value as needed to see the total at a glance.\n\nNote: The default bottle redemption amount is 0.05. Tap the Bottle Redeem field to change this value.\n\n\n\nWe’ve expanded support for a variety of sticky label printers. Add and adjust any compatible printers to print 58mm and 80mm receipts with an appropriate font size in Print Settings. 40mm print support remains: now adjust the font size as needed.\nAfter adding and selecting a sticky label printer, select the appropriate paper width for that printer.\nFrom Home, navigate to Settings > Print Settings > Printers and select the appropriate receipt width for each printer.\nOptionally, adjust the Font Size for one or more Sticky Label widths (40mm, 58mm, and 80mm), or accept the defaults.\nTap Save to save your changes.\n\n40mm: 20\n58mm: 24\n80mm: 28\n\n\nNeed to update a list of items? We’ve expanded the number of fields you can change when you modify items in bulk. You can now use this workflow to include and exclude items from discounts and promotions on a number of items quickly and easily. For businesses with online ordering enabled,  enable or disable the Make Available Online status of items in bulk, as well.\n\n\nBack to Top\n\nOpen a vendor’s details record.\nEnable Auto Dynamic Reordering.\nAccept the default purchase order generation time (Sunday, 6:00 PM) or define a custom date and time.\nSave your changes, then link this vendor to each item you enroll.\nNavigate to the Inventory tab of an item.\nEnable Dynamic Reordering, and define a Safe Qty for the item. This disables the Reorder Qty field.\nAdd or link a vendor on the item’s Purchasing tab. The vendor must be enrolled in Auto Dynamic Reordering.\nSave your changes.\nIf items enrolled in dynamic reordering are below their Safe Qty at your vendor’s Create Time, a purchase order is generated, ordering enough inventory to bring your inventory levels back up to their Safe Qty amount. Complete and process the purchase order as needed.\nIf you create a purchase order off the reorder cycle, you can add any items enrolled in Dynamic Reordering. Exatouch will suggest reordering enough inventory to reach the Safe Qty amount; accept or change to suit your needs. Complete and process the purchase order as needed.\n\n\nExatouch has a Fraud Control feature under Settings > Account which will prevent tip amounts greater than 200% on any order. This feature is enabled by default, and is accessible only by Support. Authorized representatives of your organization can work with our Support team to adjust this amount as needed.\nOnce your Tip Security amount is set, every transaction will be limited to that percentage amount. If a tip exceeds the defined percentage for that order, a warning message is shown to the user. The allowed tip amount is shown, in dollars. Customers must reduce their tip to that amount to complete the payment transaction.\n\nExample: Your Tip Security is limited to 50% of an order total. On an order totaling $108.29, a customer attempts to add a tip of $75.\n\nA warning message appears in the Register app, indicating the maximum tip amount is $53.73, or 50% of the order total.\n\n\nA warning message appears in the Register app, indicating the maximum tip amount is $53.73, or 50% of the order total.\n\n\nNote: Only the Account Owner can work with Support to change the Tip Security percentage amount from the default, 200%.\n\n\n\n\nSave time and effort by editing an item detail record as you create Purchase Orders. Users with appropriate access can update some item records directly while they build a purchase order, or toggle between an item’s record and a purchase order as needed. Enable Purchasing, Ability to Edit Item Details to give users access to this feature.\nThe ability to change the Description and Cost$ fields of items in purchase orders is unchanged. Users with appropriate access can now edit item fields such as:\nDescription (the description of the item)\nPrice (retail price)\nQty On Hand\nLow Level (low level quantity threshold)\nReorder Qty\nMinimum Qty\nSelect an item in the purchase order, then make changes to any available fields.\nAfter editing the fields you need, move to a new field, then tap the save icon to save your changes to the item record.\nTap No to leave the Item record unchanged, or Yes to save this information to the Item record.\nComplete and process the purchase order as needed.\nAlternatively, select an item in the Purchase Order, then tap the gear icon to edit the entire item record directly.\nMake changes to any fields on any section of the item record, then tap Save to save your changes, or Back to PO to cancel your changes.\nComplete and process the purchase order as needed.\n\n\nWe’ve improved the functionality of the Complete & Pay workflow for credit orders in Delivery Manager.\nAdjust tips for credit orders directly in Delivery Manager.\nAdd the tip on a credit tender order in Delivery Manager.\nOnce complete, Complete & Pay is disabled for that order.\nTo adjust or correct the tip when Complete & Pay is disabled, update the Tip field in the Review section of Complete Auth.\nThe functionality for Complete & Pay in retail (non-tipping) environments completes the order with no option for tip adjustment.\n\nTip! Not sure what version of Exatouch you’re running? Click here to learn how to find out.\n\n\nReady to Upgrade?: Contact Technical Support at 800-966-5520 – Option 3.\n\n\nBack to Top\n\nWe’ve expanded the customization and display options on your Customer Facing Display (CFD) to include:\nDisplay Cash and Credit totals, reflecting Checkout Fees and tender discounts (if applicable)\nExpanded image storage – rotate through multiple image groups using time-based settings\nAdd text to messages – Announce specials, share updates, and more\n\n\nExatouch offers you a variety of options to apply promotions and discounts to your items, including the ability to exclude individual items from all discounts and promotions. Navigate to the Promo work area in Item Details for an item, then enable Exclude From Discounts, Exclude From Promotions, or both to exclude this item from discounts, promotions, or both. Tap Save to save your changes.\n\n\nWe’ve consolidated Customer Facing Display (CFD) settings in one location. From Home, navigate to Settings > Preferences > Display to make changes and upload images.\nUpload and preview images for Lock Screen, Receipt, CFD/Bematech, Screen Saver (Exatouch), Screen Saver (CFD)\nDefine and order of display for images (CFD/Bematech)\nSet the length of time to display images (CFD/Bematech)\nDefine promotional messages (CFD/Bematech)\nAdd your brand logo (Receipt, Lock Screen)\nSelect a logo display preference (Exatouch, Table Turn, None)\n\n\nWe have expanded the import capabilities of Exatouch to allow you to import up to 20 alternate SKUs (AltSKU) as a part of your inventory item import.\n\n\nClosing a batch (settling credit card transactions) that includes offline transactions is an important part of keeping your cash flow moving. We’ve added expanded batch settlement options, added an offline transactions alert, and created the Offline Sales Report.\n\nNote: This update removes Complete Offline button from the Register submenu. Completing offline transactions is now part of closing a batch after Exatouch has reconnected to the internet.\n\nA red banner and exclamation icon indicate Exatouch is offline. If you have enabled Offline Processing, you can continue to accept card payments that meet your Offline Processing settings for transaction amounts and required information.\nThe red offline banner message changes when Exatouch reconnects to the Internet.\nIf there are no offline transactions in the open batch, all red offline indicators disappear.\nIf there are offline transactions in the open batch, a yellow banner and exclamation icon indicate you have an open batch that includes offline transactions.\nIf there are offline transactions in the open batch and the batch remains open more than 24 hours, the yellow messaging changes to red, indicating offline transactions are in an batch open more than 24 hours.\nThese messages help you remember to take the important step of settling offline transactions and closing the batch when Exatouch reconnects to the internet.\nAfter you have settled the batch for all outstanding offline transactions, the offline transaction warning message disappears until the next time the batch includes offline transactions.\nAfter you have settled the batch for all outstanding transactions, the open batch warning message disappears until the next time the batch remains open for more than 24 hours.\nThe Offline Sales Report is included in Sales Report work area.\n\n\nExatouch allows you to keep pickup and delivery times handy by printing them directly on kitchen receipts, delivery tickets, and customer receipts.\n\n\n\n\nUse Checkout Fees and Tender Discounts? With this release, your customer receipts reflect the cash and credit totals due.\n\nBack to Top\nClick here to schedule your software update today!\nRelease Notes - 2021\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/new-feature-dynamic-reordering-8-324/"
  },
  {
    "title": "Custom Buttons",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tAugust 31, 2023\nMerchants will love a quicker checkout when they customize their register with custom buttons! Custom buttons can be configured to execute functions, quickly add items or services to an order, and apply discounts.\nThis article displays a map of five locations at the Register, where you can add/remove custom buttons. Also included in this article are instructions on how to add, move, and remove custom buttons.\n\nFrom Home, navigate to Settings > Register Preferences.\nTap the Custom Buttons tab.\nView the Custom Buttons settings screen.\nThe Custom Buttons screen features five tabs that control basic custom button settings. Each register area corresponds to a tab within the following custom button settings: Top Buttons, Buttons, Details, Controls, and Sub Menu.\nCustom buttons control one of the following categories: Function, Items, Services, Discounts/Other.\nFor restaurants, custom buttons found on the Top Buttons tab correspond to default order types found on the Register.\nOrder types include Dine In, Take Out, Pickup and Delivery.\nOrder types can be customized to meet business needs. For example, a quick service restaurant can apply the following custom button order types: Window 1, Window 2, Dine In, and Delivery.\n\nNote: The Top Buttons tab does not display by default, though retailers can remove/clear these buttons in custom button settings.\n\nButtons listed under the Buttons tab correspond to the red and grey default buttons on the Register. Default functions observe the following rules:\nButtons tab custom buttons display at the bottom of the Register by default.\nDefault functions in the red and grey rows vary by business type.\nExample: Restaurants display a Tab Auth button by default.\nExample: For faster processing, retailers may add a Customer Payout button or Quick Pay button, such as Lotto, Scratch-Off, or Money Order. See: Set Up Quick Payouts.\nRestaurants, pizzerias, and quick service restaurants have two custom button lines enabled by default. Retailers have one line enabled by default.\nRestaurants, and retailers can enable up to three custom button lines.\nButtons found on the Details tab correspond to default functions found on the Register’s Order Details tab. Any of these functions can be moved to a different tab or removed.\nButtons found on the Controls tab correspond to the default control functions found on the Register. The Controls tab observes the following rules:\nControl functions display on the Register regardless of the tab selected.\nAny control function can be moved to a different tab or removed.\nThe Sub Menu tab and functions within correspond to the default functions found in the Register’s Sub Menu. The Sub Menu tab observes the following rules:\nFunctions display at the register when you tap the Sub Menu icon in the lower right-hand corner of the Register.\nAny Sub Menu function can be moved to a different custom button or removed.\nCustom button options include the following: Function, Items, Services, and Discounts/Other.\nAny function that can be moved, added, or removed from the Register is found in the Function list. Functions may vary by restaurant or retailer type.\nThe complete list of special functions includes the following. Note that some functions are exclusive to restaurants while others are exclusive to retail:\nDine In (Restaurant Only)\nIn Store (Retail Only)\nTake Out\nPick Up\nDelivery\nOrder Type\nClub\nDelivery Service\nSave Order\nGet Order\nPrint Order\nPrint Remote\nFind Items\nMisc. Sale\nOpen Item Taxable\nOpen Item Non Taxable\nTo-Go Item\nPrint To-Go\nCustomer Payout\nQuick Payout\nCourse Seats (Restaurant Only)\nFire (Restaurant Only)\nFire Now (Restaurant Only)\nApply Group Tip (Restaurant Only)\nComplete Auth (Restaurant Only)\nReassign\nTake\nRepeat Line\nRemove Line\nSplit by Item\nDiscount\nInfo\nRefresh Promo\nMods\nPrice Override\nUndo Admin Fee\nTax Exempt Item\nFind Customer\nAdd Service\nAdd/Mod Tips\nPay Out/In\nSell Gift Cert\neGiftSolutions\nCheck Balance\nExchange Item\nBottle Calculator\nDelivery Manager\nBank Manager\nBank Swap\nAge Check\nClose Batch\nOpen Drawer\nRefund\n\nNote: Special functions unavailable at the Register by default can be added via custom buttons. Special functions include Order Type, Club, To-Go Item, Print To-Go, Quick Payout, Price Override, Undo Admin Fee, and Tax Exempt Item.\n\nItems can be added to the Register for quick access. All items that are active in the merchant’s inventory can be found on the Items list. The items available on this list are unique to this merchant:\nServices can be added to the Register for quick access. All services that are active in the merchant’s inventory can be found on the Services list. Services vary by merchant.\nAll whole order discounts, promos, service charges, and single line discounts are available on the Discounts/Other list. The following image illustrates a sample Discounts/Other list for a merchant:\n\n\nMerchants can create a custom button for any item or service in their database to the register for quick and easy access.\n\nExample:  A diner’s famous Aloha Burger is its most ordered item! For quick access, they add Aloha Burger directly to the register as a custom button.\n\nNavigate to the Custom Button screen and perform the following to add an Aloha Burger custom button to the Register.\nOn the Custom Button screen, tap Buttons.\nSelect an available button from the grid. Available buttons are blank. Buttons can be cleared to make room for another function.\nFrom the Items list, select Aloha Burger. Scroll or enter keywords into the Search field.\n\nNote: Services can be added to the Register by selecting from the Services list.\n\nVerify the assignment of Aloha Burger to the new location.\nTap Save.\n\nTip!  Check your work! Navigate to the Register to view Aloha Burger in the custom buttons section.\n\n\n\nCustomize your register by using custom buttons to add Special Function buttons. Special Functions include options such as: order types, Club, To-Go Item, Print To-Go, Quick Payout, Price Override, Undo Admin Fee, Tax Exempt Item, and more.\nSpecial Functions are not available on the Register app by default. Add them easily from the Custom Buttons screen.\nOn the Custom Buttons screen, tap Buttons to display the Register buttons grid.\nSelect an available button.\nSelect a special function from the Function list.\nTap Save.\nCustom buttons can be added to different work areas of the Register app.\n\n\nCustomize your workflow by moving frequently used functions to a prominent location on your register.\n\nExample:  A pizzeria with a booming delivery business moves its Delivery Manager button to a more prominent location on their register. Delivery Manager can be moved from the sub-menu to a button on the Register tab. The Delivery Manager default location is on the Sub Menu:\nDelivery Manager after moving to the Register tab:\n\nDelivery Manager after moving to the Register tab:\n\n\n\nExample:  During the holiday season, merchants who use eGift cards frequently move the eGift function from the Order Details tab to the Register tab for quicker access. By default, the eGiftSolutions button is located on the Order Details tab:\nIn this example, the eGiftSolutions button has been moved to the Register tab:\n\nIn this example, the eGiftSolutions button has been moved to the Register tab:\n\n\nPerform the following to move the Delivery Manager button from the Sub Menu to the Register tab:\nOn the Custom Buttons screen, tap the Buttons tab.\nSelect an available button.\nFrom the Function list, select Delivery Manager.\nOn the pop-up screen, tap Yes.\nWhen the Delivery Manager custom button displays, tap Save.\n\nNote: Tap Reset Default to restore default button locations.\n\n\nUsers can remove a previously added custom button from the register.\n\nExample: \nA restaurant has course firing available as a feature, but does not wish to use it. The restaurant can remove the Course Seats custom button from the Register.\nBefore removing the Course Seats custom button:\nAfter removing the Course Seats custom button:\n\nA restaurant has course firing available as a feature, but does not wish to use it. The restaurant can remove the Course Seats custom button from the Register.\nBefore removing the Course Seats custom button:\nAfter removing the Course Seats custom button:\n\n\nPerform the following to remove a function from the Register:\nOn the Custom Buttons screen, tap Buttons to display the Register buttons grid.\nSelect a custom button to remove, then tap Clear Button.\n\nCaution: Avoid tapping Clear Page by Mistake. Clearing the page clears all buttons at once.\n\nThe Course Seats button displays as blank.\nTap Save.\n\nClick here to schedule your software update today!\nRegister App Setup\nCustom Buttons\nCustom Buttons: Add a Discount to the RegisterLast Updated: November 6, 2023\nLast Updated: November 6, 2023\nDifference Between Custom Buttons and Custom VariablesLast Updated: May 6, 2024\nLast Updated: May 6, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/custom-buttons/"
  },
  {
    "title": "Custom Buttons: Add a Discount to the Register",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tNovember 6, 2023\n\nFor quicker access, create a specialized discount or promo by adding a discount custom button directly to the register!\n\nNote: Discounts, promos, or service charges which have been created in the Promos module can be added to the register via custom buttons. See: Create a Discount\nExample: A convenience store offers military discounts to their customers. To more quickly serve their veterans, Armed Forces is added as a custom button to the register.\n\nFollow these steps to place an Armed Forces button on the Order Details tab at the Register:\nFrom Home, navigate to Settings > Register Preferences.\nTap Custom Buttons.\nFrom the Custom Buttons screen, tap the Details tab. For more information about button locations, see: Understanding Custom Buttons.\nSelect an available button from the custom buttons grid. Available buttons have no label. If no buttons are available, a button can be made available by clearing it. To remove a function, item, service or promo from a button, see:  Custom Buttons: Remove a Function from the Register.\nFrom the Discounts/Other list, select Armed Forces. Scroll or use the Search field to find a discount, promo or service charge.\nThe Armed Forces button displays in the assigned location within the custom buttons grid.\nTap Save.\n\nTip! Check your work! Navigate to the Register, select or create an order, and tap the Order Details tab to view the Armed Forces custom button.\nAlso see: Understanding Custom Buttons and Custom Buttons: Move a Function at the Register\n\nSet Up & Manage Discounts\nCustom Buttons\nPromotions & Discounts\nHow to Use DiscountsLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nCreate a DiscountLast Updated: November 2, 2023\nLast Updated: November 2, 2023\nEnable Tender Discounts (Cash Discount Program)Last Updated: August 16, 2024\nLast Updated: August 16, 2024\nApply an Item DiscountLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nApply an Open DiscountLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nApply a Global DiscountLast Updated: February 8, 2024\nLast Updated: February 8, 2024\nDeactivate Discounts and PromosLast Updated: January 17, 2023\nLast Updated: January 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/custom-buttons-add-a-discount-to-the-register/"
  },
  {
    "title": "Difference Between Custom Buttons and Custom Variables",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMay 6, 2024\nCustom buttons affect the register, allowing you to create specialized buttons on your register interface.\nCustom variables affect data fields within Exatouch, such as Item’s Details or Customer Details. Definitions of custom variables can create additional opportunities for custom buttons. For example, defining custom Customer Payout types creates the opportunity to place specific Customer Payout buttons at the register. Custom variables alone do not place buttons at the register; buttons are placed at the register via custom buttons.\n\nExample: Liquor store adds an Age Check button to their register. Age Check is an Exatouch function located by default within the global menu (right side Exatouch menu). When this merchant added an Age Check button to their register, they moved it from the global menu to a register button, giving this merchant quicker access to the age verification function.\nExample: A convenience store often issues customer payouts for lotto and scratch-offs. This merchant placed a Customer Payout button directly on their register via custom buttons, allowing them to process customer payouts quickly. For even quicker access, this merchant has also added a Lotto button via custom buttons. The “Lotto” button is a type of Quick Payout, which involves first defining custom variables before they can be placed as custom buttons. See: Setup Quick Payout\nExample: Restaurant adds “Staff Type” descriptions to their staff records to better track employee roles. “Staff Type” descriptions are defined on the Custom Vars (custom variables) tab under Settings > Preferences. This merchant defines custom variables for Staff Type as Delivery, Cashier, Manager, Sales, and OldDelivery. These custom variables appear in the Staff Type drop-down under Staff > Staff Details.\nSee: Define Custom Variables\n\nClick here to schedule your software update today!\nCustom Buttons\nDefine Custom VariablesLast Updated: June 14, 2023\nLast Updated: June 14, 2023\nAge Verification at the RegisterLast Updated: June 18, 2024\nLast Updated: June 18, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/difference-between-custom-buttons-and-custom-variables/"
  },
  {
    "title": "Create Categories and Subcategories",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tMarch 13, 2024\nCompatible Version: 8.328Does your Exatouch look different? View prior release →\nOrganize your items and services using categories and subcategories to get the most out of Exatouch:\nFind items more easily in the Register app.\nCreate category and subcategory level promotions.\nReview sales, inventory movement, and more in available reports.\nPrint subcategory items to specialized printers, as needed.\n\nFrom Home, navigate to Items > Categories to open the Category work area.\nTap New Category to start a new category.\nEnter a Description, and select a category type: Items category or Services category.\nDefine other settings as needed for this category. Tap Save to save your changes.\nCreate subcategories for this category to accommodate different types of items. Repeat as needed to create categories for your items.\n\n\nFrom Home, navigate to Items > Categories to open the Category work area.\nSelect a category, tap None in the Subcategories work area, then tap New Subcat to start a new subcategory.\nEnter a Description name. The subcategory type (item or service) is inherited from the parent category.\nDefine other settings as needed for this subcategory. Some settings are inherited from the parent category.\nTap Save to save your changes.\nRepeat as needed to create additional subcategories.\n\n\nSeveral settings you apply to categories are inherited by the subcategories. Edit subcategories to have different settings from its parent category as needed.\nSelect a category or subcategory to adjust these options, then tap Save to commit your changes.\nDescription – The name of the category or subcategory. Shows in the Register app (if enabled) and in applicable reports.\nVisible On Register – Enabled by default. Disable to hide this category or subcategory in the Register app.\nDisplay Color: – The color of the category and subcategory. The selected color shows in this work area and the Register app. Editable when Visible On Register is enabled.\nOrder Limit Qty: – Set to restrict customer purchases to this quantity of items in this category or subcategory level.\nMod Add Price: – The price to add items in this category or subcategory as modifiers.\nPrint On: – Tap to enable or a printer or printers items in this category or subcategory should print to. (Remote Printer 1-8, Sticky Label Printer 1-3)\nOn Sale – Enable to define a sale for items in this category or subcategory.\n\n\nCategories and Subcategories are displayed in the Register app by default.\nDisable Visible On Register for a category or subcategory to hide items that are modifiers to menu items, or do not need to appear in the Register app.\nModifiers – items such as toppings or extras, with or without cost. When assigned to an item, modifiers are only shown when that item is selected in the Register app.\nRequired adders – Items added to an order when an associated item is purchased.\n\nFree items – Gifts with purchase, such as a gift bag or accessory set.\nCharged Items – Bottle deposits, keg deposits, or other costs charged to a customer that is refundable when specific conditions are met.\nFree items – Gifts with purchase, such as a gift bag or accessory set.\nCharged Items – Bottle deposits, keg deposits, or other costs charged to a customer that is refundable when specific conditions are met.\n\n\nBy default, modifiers print to the same printer as their parent item. Change this by assigning a printer to specific modifier categories or subcategories.\n\nExample: You offer Salads as modifiers to several of your entrée categories. Assign the subcategory of Salad modifiers to print to your Salad Station printer.\n\nAfter you set up printers for your modifiers, parent items print to their assigned printers, while modifiers are routed to appropriate newly-assigned printers.\nItem Categories & Subcategories\nAdd an ItemLast Updated: August 29, 2024\nLast Updated: August 29, 2024\nDuplicate Items and ModifiersLast Updated: January 4, 2024\nLast Updated: January 4, 2024\nLimit Quantity Sales Using Order Limit QuantityLast Updated: April 26, 2024\nLast Updated: April 26, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-categories-and-subcategories/"
  },
  {
    "title": "Difference Between Required and Optional Modifiers",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tSeptember 18, 2024\nModifiers can either be required or optional. Required modifiers pop-up automatically when an associated item is selected. Optional modifiers are selected manually.\nAppear under Required Modifiers at the register.\nPop-up automatically when an item with required modifiers is rung up. This is a register default.\nPresented in a Group from which one option must be selected.\nExample: When ordering a hamburger, a customer is required to choose a meat temperature from among the modifier options “well,” “medium,” or “rare.”\nAppear under Optional Modifiers at the register.\nExample: A customer can select hamburger toppings such as “mayo,” “onion,” or “pickle,” but those modifiers are not required.\nClick here to schedule your software update today!\nAdding & Managing Items\nItem Categories & Subcategories\nModifiers\nCreate a ModifierLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifier to a GroupLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifiers to an ItemLast Updated: September 27, 2023\nLast Updated: September 27, 2023\nView Modifiers at the RegisterLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/difference-between-required-and-optional-modifiers/"
  },
  {
    "title": "EBT Payments",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tNovember 17, 2023\nWe’ve updated how EBT payments are made! EBT Cash and EBT Food functions are enabled independently. EBT Cash and EBT Food payments can also be added as payment options on the Register.\n\nNote: Please note that changes in federal banking regulations may result in adjustments to the EBT, dual pricing, cash discount features.\n\nTo enable EBT payment settings, perform the following:\nFrom Home, navigate to Items > Item Details.\nTap the Details tab.\nToggle the EBT Cash slider to enable the EBT cash option.\nToggle the EBT Food slider to enable the EBT food option.\nTap Save.\n\n\nMerchants can also add EBT Cash and EBT Food as payment options on the register Pay tab. To add these payment options, perform the following:\nFrom Home, navigate to Settings > Register Preferences.\nTap the Custom Tenders tab. The Custom Buttons screen displays.\nIn the Pay Tender work area, select a payment option. The Tender work area illuminates.\nSelect EBT Cash and/or EBT Food from the Tender work area to replace the payment option you initially selected in the Pay Tender work area.\nTap Save.\nWhen ringing up a scale, EBT Cash and/or EBT Food display as payment options in the Pay tab.\n\nNote: EBT payments must be processed first when combined with other payment methods.\n\n\nClick here to schedule your software update today!\nTax Rate Setup\nSet General Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Per Unit Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nSet Pre- & Post-Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/ebt-payments/"
  },
  {
    "title": "Set Tax Rates for an Individual Item",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tOctober 30, 2022\nCompatible Version: 8.286+Does your Exatouch look different? View prior release →\nSome default tax settings apply to a newly added item, but you can adjust the settings as needed for any items in Item Details.\nFind an item and open the Item Details work area.\nTap Tax & GL to open the Tax & GL work area.\nEnable or disable appropriate tax settings, then Save your changes.\nDepending on your Exatouch installation, not all options shown may be available.\nTax Included: Enable or disable to define an item’s tax included status.\nTax Groups A-D: Enable or disable one or more regular tax groups. The labels for these groups may indicate local taxing authorities, such as city, county, or state tax names.\nType: Tap to select a per unit tax rate. These options are custom designed for your business, such as liquor, tobacco, or sweet beverage taxes. These options (Group E, Group F, and Group G) are defined by the unit, gallon, or liter.\nTax Group H: Tap to select a pre or post tax rate, as defined in your tax settings.\nTax Group I: Tap to select a pre or post tax rate, as defined in your tax settings.\n\nTip! Taxes can be applied to a group of items. See: Modify Bulk Items\n\n\nAdding & Managing Items\nTax Rate Setup\nSet General Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Per Unit Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Pre- & Post-Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-tax-rate-for-an-individual-item/"
  },
  {
    "title": "Set Tax Rate for an Individual Service",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tNovember 1, 2022\nTax rates are usually set when a service is first created, but tax rates can be added or adjusted to an existing service.\nFollow these steps to set tax rates for an individual service:\nFrom Home, navigate to Items > Service List.\nSelect a service. Scroll or use the search options to find a service.\nIn the Tax section, select one or multiple taxes.\nTap Save.\n\n\nTax Groups A-D: Choose one or more of these regular tax groups. Custom labels may display. Tax Groups are labeled in Settings.\nTax Groups E-G: These are Liquor, Tobacco, and Sweet Beverage Tax. Choose from a Type from the drop-down box\nTax Group H: This is pre-tax, which applies to the order sub-total before regular taxes are applied.\nTax Group I: This is post-tax, which applies to the order total after all other taxes are applied.\n\nTip! Taxes can be applied to a group of services.  See: Modify Bulk Services\n\nClick here to schedule your software update today!\nTax Rate Setup\nSet General Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Pre- & Post-Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nEBT PaymentsLast Updated: November 17, 2023\nLast Updated: November 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nPhoneThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-tax-rate-for-an-individual-service/"
  },
  {
    "title": "Set General Tax Rates",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tApril 9, 2024\nTax rates are configured in Tax Group Settings. Tabs in Tax Group Settings correspond to different types of taxes: General, Per Unit, and Pre & Post. On each tab, tax rates are defined in Groups. Tax Groups are labeled alphabetically (i.e. Tax Group A, Tax Group B) but can be assigned custom labels as well.\nGeneral Taxes are set up on the General tab under Settings > Tax Group Settings. Tax Groups A, B, C, and D are designated for General Taxes.\n\nFrom Home, navigate to Settings > Tax Group Settings.\nConfirm that the General tab displays.\nSelect a Tax Group to assign. Best practice is to configure the first available group. For example, configure Group A before Group B.\nCustomize Tax Group names by selecting a generic label name and entering a new name in the pop-up, then tap OK. For example, change “Tax Group A” to “FL State PB County”.\nCustomize the names of individual taxes by clicking on a generic label name and typing in a name. For example, change Tax A1 to City Tax. Change Tax A2 to County Tax.\nEnter desired tax rates for each individual tax.\nAdditional Tax Groups can be created by filling in tax rates for each group (i.e. Group B, Group C…)\nTap Save.\n\nTax Groups A-D can be customized according to your specifications.\nShow On Receipt: Select to display the tax details on customer receipt.\nDefault For Items: Select this check box to apply the Group’s tax rules to all items. Different tax rules can be applied later to individual items. See: Set Tax Rate for an Individual Item\nDefault For Services: Select this check box to apply the Group’s tax rules to all services. Different tax rules can be applied later to individual services. See: Set Tax Rate for an Individual Service\nAdmin Fee: A fee implemented by retailers, restaurants and other businesses to help with business expenditures, maintain exceptional service, and provide competitive prices.\n\nTip! Just as you can apply multiple tax rates to a single item, you can apply multiple Tax Groups as your System Default. For example, you can check Default For Items in both Group A and Group B.\n\n\nNote: Examples below are instructional only and should not be used as tax advice. Consult with your state’s department of revenue and/or your knowledgeable sales tax accountant to determine how to apply taxes in your location.\n\nTax on water bottles in Maryland convenience stores: 6.00% Sales and Use tax.\nTax on clothing in a Batesville, AK retail boutique: 6.5% State tax rate, 1.75% County tax rate, 2% City tax rate.\nTax on prepared, hot food items in a New York City, NY fresh market: 4.5% State tax, 4% Local sales and use tax, 0.375% Metropolitan Commuter Transportation District surcharge. Non-perishable grocery items are tax exempt. Only apply these taxes to prepared, hot foods.\n\nClick here to schedule your software update today!\nVideos\nTax Rate Setup\nSet Per Unit Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Pre- & Post-Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nEBT PaymentsLast Updated: November 17, 2023\nLast Updated: November 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-general-tax-rates/"
  },
  {
    "title": "Set Pre- & Post-Tax Rates",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tApril 9, 2024\nTax rates are configured in the Settings module. Tabs in Tax Group Settings submodule correspond to different types of taxes: General, Per Unit, and Pre & Post. On each tab, tax rates are defined in Groups. Tax Groups are labeled alphabetically (i.e. Tax Group A, Tax Group B) but can be assigned custom labels as well.\nPre & Post taxes are set up on the Pre & Post tab under the Tax Group Settings submodule. Tax Groups H and I are designated for pre-taxes and/or post-taxes.\nNote: Pre and Post taxes are NOT intended to be used to apply a surcharge. Pre and Post taxes are applied to all orders, regardless of the customer’s payment method.\nFrom Home, navigate to Settings > Tax Group Settings.\nTap the Pre & Post tab.”\nSelect Group H or Group I. We suggest selecting the first available Tax Group. For example, select Group H before Group I.\nCustomize Tax Group names by selecting a generic label name and entering a new name. For example, change “Tax Group H” to “Occupational Tax.”\nSelect either Pre or Post for the tax type.\nSelect either % or $ for the unit.\nCustomize the names of individual taxes by selecting a generic label name and entering a name. For example, change “Tax H1” to “County Tax.”\nEnter relevant tax information.\nCreate additional Tax Groups, if desired, by entering tax rates for each group (i.e. Group H and Group I).\nTap Save.\nNote: One or multiple Tax Groups can be created. For example, taxes applied to soda may be different than taxes applied to beer. In this case, you would create Group E: “Tax rates for soda” and Group F: “Tax rates for beer.”\n\n\nPre-tax amounts are applied to an item subtotal. Post-tax is an additional tax calculated after regular taxes are applied.\nPre or Post: Select either Pre or Post to indicate either a pre-tax or a post-tax.\n% or $: Select either the % or $ to indicate if the tax is a percentage applied or a specific dollar amount.\nShow On Receipt: Select to display the tax details on the customer receipt.\n\n\nPre-tax amounts are applied to an item subtotal. Once pre-tax is calculated, regular taxes are applied.\nFor example, on a $20 item calculate a regular tax of 10% after applying a 4% pre-tax: ($20 + 4% pre-tax = $20.80) + 10% overall tax = $22.88. The total tax for this transaction is $2.88.\n\n\nPost-tax is an additional tax calculated after regular taxes are applied. For example, on a $20 item calculate a regular tax of 10% + a 4% post-tax: $20 (10% regular tax + 4% post-tax) = $22.80. The total tax for this transaction is $2.80.\n\nNote: The following example is instructional only and should not be used as tax advice. Consult with your state’s department of revenue and/or your knowledgeable sales tax accountant to determine how to apply taxes in your location.\n\nOccupational Tax in Madison County, KY: Additional 1% tax on any work done outside Madison County city limits. This is a post-tax, calculated after regular taxes are applied.\n\n\nClick here to schedule your software update today!\nVideos\nTax Rate Setup\nSet General Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Per Unit Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nEBT PaymentsLast Updated: November 17, 2023\nLast Updated: November 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-pre-post-tax-rates/"
  },
  {
    "title": "Set Per Unit Tax Rates",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tApril 9, 2024\nDownloadable Files:\n\nTax rates are configured under the Settings module. Tabs in the Tax Settings submodule correspond to different types of taxes: General, Per Unit, and Pre & Post. On each tab, tax rates are defined in Groups. Tax Groups are labeled alphabetically (i.e., Tax Group E, Tax Group F), but can be assigned custom labels too.\nPer Unit taxes are set up on the Per Unit tab. Tax Groups E, F and G on the Per Unit tab are designated for liquor, tobacco, and sweet beverage taxes. These tax groups can be assigned a “per unit” cost.\nFrom Home, navigate to Settings > Tax Group Settings.\nTap the Per Unit tab.\nSelect Group E, F, or G. We suggest selecting the first available Tax Group. For example, select Tax Group E before Tax Group F.\nCustomize Tax Group names by clicking on a generic label name and typing in a name. For example, change Tax Group E to Sin Tax.\nSelect a unit type from Unit, Gallon, Liter.\nCustomize the names of individual taxes by clicking on a generic label name and entering a name. For example, change “Tax E1” to “Beer Tax.” Change “Tax E2” to “Liquor Tax”\nEnter relevant tax rates.\nCreate additional Tax Groups by entering tax rates for each group (i.e. Group F, Group G).\nTap Save.\n\nNote: One or multiple Tax Groups can be created. For example, taxes applied to soda may be different than taxes applied to beer. In this case, create Group E: “Tax rates for soda” and Group F: “Tax rates for beer.”\n\nUnit, Gallon, and Liter: Select either Unit, Gallon or Liter to describe the measurement of the item you are taxing. For example, a Beer Tax might be $0.18 per gallon. Group E = “State Liquor Tax;” Tax E1 = “Beer Tax;” Value = 0.18. Select the Gallon checkbox.\nShow On Receipt: Select to display the tax details on customer receipt.\n\n\nNote: Examples below are instructional only and should not be used as tax advice. Consult with your state’s department of revenue and/or your knowledgeable sales tax accountant to determine how to apply taxes in your location.\n\nCounty Sin Tax for a liquor store: $0.045 per pack of cigarettes, $0.015 per 12 oz bottle of beer (equivalent to $0.580/gal), $0.60 per 750 mL bottle of wine, $0.32 per gallong mixed beverages, $0.24 per gallon hard cider, $3 per gallon hard liquor\nTax on sweet beverages in Philadelphia, PA: $0.015 per Oz for sweet beverages (equivalent to $1.92 per gallon)\n\nClick here to schedule your software update today!\nVideos\nTax Rate Setup\nSet General Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Pre- & Post-Tax RatesLast Updated: April 9, 2024\nLast Updated: April 9, 2024\nSet Tax Rates for an Individual ItemLast Updated: October 30, 2022\nLast Updated: October 30, 2022\nSet Tax Rate for an Individual ServiceLast Updated: November 1, 2022\nLast Updated: November 1, 2022\nEBT PaymentsLast Updated: November 17, 2023\nLast Updated: November 17, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/set-per-unit-tax-rates/"
  },
  {
    "title": "Add Cost to a Modifier",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tFebruary 21, 2024\nCost can be associated with a modifier. For example, “Garden Burger” may have a “Sides” modifier group which includes: “w/Fries”, “w/Chips”, and “w/Side Salad”, where the addition of fries costs $1.75. When a modifier is assigned a price, the $ symbol appears next to it when added to an order.\nCost can be assigned to a modifier in the Modifiers section of Items Detail.\nFrom Home, navigate to Items > Item List.\nSelect an item which is also a modifier. Items designated as modifiers are often in the “Mods” category. Scroll or use search options to find a specific item. See: Find an Item\nSelect the Modifiers tab.\nEnter the the Modifier Price, then tap Save.\n\nNote: Modifier price is the amount you charge the client at the register. This is different from the unit cost paid to the manufacturer of the item. Unit cost is assigned under the Pricing tab, in the Cost section of Items Detail.\nSee: Create a Modifier\n\nClick here to schedule your software update today!\nModifiers\nWhat is a Modifier?Last Updated: February 2, 2023\nLast Updated: February 2, 2023\nCreate a ModifierLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nCreate Special Instruction ModifiersLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nDefine Custom VariablesLast Updated: June 14, 2023\nLast Updated: June 14, 2023\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/add-cost-to-a-modifier/"
  },
  {
    "title": "Enable Duplicate Required Modifiers",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tFebruary 16, 2024\nDuplicate modifiers make it easy for restaurants to accommodate a double portion of burger toppings or extra pickles on the side! The duplicate modifier option is enabled in Register Preferences. Once enabled, individual modifier options are adjusted on an item-level to accommodate duplicate MOD selections within a modifier group.\nFrom Home, navigate to Settings > Register Preferences.\nTap the Orders tab.\nEnable the Allow Duplicate Modifier slider.\nTap Save.\n\n\nAfter enabling in Register Preferences, Duplicate Modifiers are activated for specific modifier groups. Modifier groups can be adjusted under Item Details on the MODS tab.\nFrom Home, navigate to Items > Item Details.\nIf the item is not already featured, tap All Items to view a list of items.\nSelect an item. Use the scroll or search features to narrow your search.\nTap the Modifiers tab.\nView This Item’s Modifiers to familiarize yourself with modifier group assignments. Scroll down to view group listings in the right-hand column.\nTap Manage Group.\nAdjust group settings by entering a value in the Minimum and Maximum columns.Note: In order for Duplicate Modifiers to work, the “Maximum” number of allowed choices must be 2 or greater. For example, if Group A has “Minimum” choice of 1 and “Maximum” choice of 1, selection is limited to 1 which prevents staff from adding a duplicate. If Group B has a “Minimum” choice of 1 and “Maximum” choice of 2, then a second or duplicate choice is permitted.Tip! Easily assign a custom label to each modifier group. Tap a Description and type a label name. For example, Group E can be labeled Flavor. See: Label a Modifier Group\nNote: In order for Duplicate Modifiers to work, the “Maximum” number of allowed choices must be 2 or greater. For example, if Group A has “Minimum” choice of 1 and “Maximum” choice of 1, selection is limited to 1 which prevents staff from adding a duplicate. If Group B has a “Minimum” choice of 1 and “Maximum” choice of 2, then a second or duplicate choice is permitted.\nTip! Easily assign a custom label to each modifier group. Tap a Description and type a label name. For example, Group E can be labeled Flavor. See: Label a Modifier Group\nTap Save.\n\n\nPerform the following to select a duplicate modifier at the Register:\nSelect an item from the Register app (e.g., Boom Boom Burger).\nReview the modifier group options that display.\nGroup A (Size) allows only one selection. When settings are “Min: 1”, “Max: 1”, no description is noted on the group description.\nGroup B (Heat) allows only one selection. When settings are “Min: 1”, “Max: 1”, no description is noted on the group description.\nGroup C (Sides) requires 1 selection and allows a maximum of 2 selections, as indicated by “Min: 1”, “Max: 2.” Because duplicate modifiers are enabled and there is room for 2 selections. For example, select an order of steak fries by tapping Steak Fries, and then tapping Chips.\nEnter the customer’s choices.\nFrom Group A (Size), the customer selects Make It 1/2 lb.\nFrom Group B (Heat), the customer selects Med Well.\nGroup C (Sides), the customer orders two sides: Chips and Steak Fries as sides.\nReview the customer’s choices.\nTap Save Mods.\nReview selections.\n\n\nClick here to schedule your software update today!\nModifiers\nCreate a ModifierLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nCreate Instruction ModifiersLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nCreate Special Instruction ModifiersLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/enable-duplicate-required-modifiers/"
  },
  {
    "title": "Create a Modifier",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tSeptember 18, 2024\nA modifier is an item which further describes or amends a customer’s order.\nCreate a MOD by first creating an item, and then designating it as a modifier.\nFrom Home, navigate to Items > Item Details.\nTap New.\nEnter item details, with special attention to Category and Subcategory assignments.\nFrom Home, navigate to Items > Item Details.\nTap New.\nEnter item details, with special attention to Category and Subcategory assignments.\nExample:  You may wish to create a new Meat Temp modifier which would reside in the Mods Category and the Meat Temp Subcategory. If you do not yet have appropriate categories or subcategories in place, see: Create Categories and Subcategories. For detailed instructions on filling out item details, see: Add an Item.\nTap Save.\n\n\nNote: Items designated as modifiers can be actual items (e.g., “w/Chips”), or item descriptions (e.g., “Medium Well”).\n\nTap the Modifiers tab.\nVerify the correct item displays in the Item Name field.\nToggle the Modifier slider to enable the modifier.\nTap Save.\n\nTip! To add cost to a modifier, enter the Modifier Price  field. For example, a “w/Fries” modifier may be assigned a cost of $1.75. See: Add Cost to a Modifier.\n\nNext see: Add Modifiers to an Item\nClick here to schedule your software update today!\nModifiers\nView Modifiers at the RegisterLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifier to a GroupLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifiers to an ItemLast Updated: September 27, 2023\nLast Updated: September 27, 2023\nAdd Cost to a ModifierLast Updated: February 21, 2024\nLast Updated: February 21, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nCommentsThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/create-a-modifier/"
  },
  {
    "title": "Add Modifier to a Group",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tSeptember 18, 2024\nModifiers can be either required or optional. Required modifiers are identified as such by being added to a modifier group. Adding a modifier to a group will enable it to appear with other required mods when a customer rings up an order at the register.\nNote: A modifier is added to a group for EACH item it modifies. Example: If Bleu Cheese Dip is a required modifier for both 6 Wings and 24 Wings, first Bleu Cheese Dip is added to the group that modifies 6 Wings and then Bleu Cheese Dip is added to the group that modifies 24 Wings.\nFrom Home, navigate to Items > Item Details.\nFrom the Item List screen, scroll to select an item or enter keywords in the Search field.\nVerify the correct record displays. If not, tap All Items to find another item. See: Find an Item.\nTap the Modifiers tab.\nSelect an item from the Modifies These Items list.\nTap Go To Item.\nView items in the This Item’s Modifiers list.\nThe Required column displays whether or not the associated modifier is required.\nMods are listed according to group. Scroll down to see a complete listing of mods and their groups.\n\nRequired: No – Indicates that the mod is optional.\nRequired: Group A – The mod is assigned to Group A.\nRequired: Group B – The mod is assigned to Group B.\nRequired: Group C – The mod is assigned to Group C.\n\n\n\n\nSelect the desired modifier (i.e. Med).\nSelect a group from the drop-down menu (i.e. Sauce).\nTap Save. After saving, modifiers in the This Item’s Modifiers list re-sort.\n\nThe Bleu Cheese Dip mod has been assigned to Group E group for 6 Wings.\nTip! Check your work! Navigate to the Register and place an order for 8 Wings to confirm that The Bleu Cheese Dip appears in Group E.\nFrom Home, navigate to Items > Item Details.\nFrom the Item List screen, scroll to select an item or enter keywords in the Search field.\nVerify the correct record displays. If not, tap All Items to find another item. See: Find an Item.\nTap the Modifiers tab.\nSelect an item from the Modifies These Items list.\nTap Go To Item.\nView items in the This Item’s Modifiers list.\nThe Required column displays whether or not the associated modifier is required.\nMods are listed according to group. Scroll down to see a complete listing of mods and their groups.\n\nRequired: No – Indicates that the mod is optional.\nRequired: Group A – The mod is assigned to Group A.\nRequired: Group B – The mod is assigned to Group B.\nRequired: Group C – The mod is assigned to Group C.\nFrom Home, navigate to Items > Item Details.\nFrom the Item List screen, scroll to select an item or enter keywords in the Search field.\nVerify the correct record displays. If not, tap All Items to find another item. See: Find an Item.\nTap the Modifiers tab.\nSelect an item from the Modifies These Items list.\nTap Go To Item.\nView items in the This Item’s Modifiers list.\nThe Required column displays whether or not the associated modifier is required.\nMods are listed according to group. Scroll down to see a complete listing of mods and their groups.\n\nRequired: No – Indicates that the mod is optional.\nRequired: Group A – The mod is assigned to Group A.\nRequired: Group B – The mod is assigned to Group B.\nRequired: Group C – The mod is assigned to Group C.\nRequired: No – Indicates that the mod is optional.\nRequired: Group A – The mod is assigned to Group A.\nRequired: Group B – The mod is assigned to Group B.\nRequired: Group C – The mod is assigned to Group C.\nSelect the desired modifier (i.e. Med).\nSelect a group from the drop-down menu (i.e. Sauce).\nTap Save. After saving, modifiers in the This Item’s Modifiers list re-sort.\nThe Bleu Cheese Dip mod has been assigned to Group E group for 6 Wings.\n\nTip! Check your work! Navigate to the Register and place an order for 8 Wings to confirm that The Bleu Cheese Dip appears in Group E.\n\nAdd a required mod to a group for each item it modifies. For example, add Bleu Cheese Dip to Group A for 8 Wings and also to Group A for Crab Cake Sandwich.\nFrom an item’s Modifiers tab, (i.e. Bleu Cheese Dip), select an item from the Modifies These Items list (i.e. 8 Wings).\nTap Go to Item.\nA list of all mods associated with 25 Wings displays in the This Item’s Modifiers column:\nRepeat steps to add other mods to the group.\n\n\n\nNote: Modifier Groups can be labeled. See: Label a Modifier Group.\nTip! Mods in a group can be applied in duplicate! See: Enable Duplicate Required Modifiers.\n\n\nSee: View Modifiers at the Register\nClick here to schedule your software update today!\nAdding & Managing Items\nModifiers\nAdd Cost to a ModifierLast Updated: February 21, 2024\nLast Updated: February 21, 2024\nView Modifiers at the RegisterLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nLabel a Modifier GroupLast Updated: February 15, 2024\nLast Updated: February 15, 2024\nEnable Duplicate Required ModifiersLast Updated: February 16, 2024\nLast Updated: February 16, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nNameThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/add-modifier-to-a-group/"
  },
  {
    "title": "Label a Modifier Group",
    "content": "Last Updated: \n\t\t\t\t\t    \t\t\t\tFebruary 15, 2024\nModifier Groups can be labeled, making it easier to identify and organize required modifiers.\nModifier Groups are labeled within Item Details, on the Modifiers tab.\nFrom Home, navigate to Items > Item List.\nSelect an item from the Items List screen.\nTap the Details tab. Confirm that the correct record displays. If not, tap All Items to find the item.  See: Find an Item\nTap the Modifiers tab.\nSelect Manage Group.Note: To review items listed in each group, scroll through the This item’s modifiers: list. Modifiers are listed in Group order, beginning with “No”, “Group A”, “Group B”, “Group C”, and “Group D”.\nNote: To review items listed in each group, scroll through the This item’s modifiers: list. Modifiers are listed in Group order, beginning with “No”, “Group A”, “Group B”, “Group C”, and “Group D”.\nClick on a Group name and overwrite the generic name by typing a label. For example, click on Group C and type: “Temperature.”\nTap OK.\nView new Group labels, then tap Save.\n\nTip! Check your work! Navigate to the Register and ring up an order that the new group label is in place.\n\n\n\nSee: Add Modifier to a Group\n\nClick here to schedule your software update today!\nModifiers\nAdd Modifier to a GroupLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nAdd Modifiers to an ItemLast Updated: September 27, 2023\nLast Updated: September 27, 2023\nCreate Instruction ModifiersLast Updated: September 18, 2024\nLast Updated: September 18, 2024\nEnable Duplicate Required ModifiersLast Updated: February 16, 2024\nLast Updated: February 16, 2024\nYour page rank:\nRegistered internal users can comment. Merchants, have a suggestion? Tell us more.\nFirst Name*\nLast Name*\nBusiness Name\nEmail Address*\nPhone Number\n\nCurrent Exatouch Version Number*Check Your Exatouch Version Number\nNumber of Systems*\nPreferred Upgrade Date\n                            \n                            Date Format: MM slash DD slash YYYY\n\nEmailThis field is for validation purposes and should be left unchanged.",
    "url": "https://help.exatouch.com/knowledge-base/label-a-modifier-group/"
  }
]